garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile I3C1SADRbits_t I3C1SADRbits __at(0x09A);
// bitfield macros
#define _I3C1SADR_SADR_POSN                                 0x0
#define _I3C1SADR_SADR_POSITION                             0x0
#define _I3C1SADR_SADR_SIZE                                 0x7
#define _I3C1SADR_SADR_LENGTH                               0x7
#define _I3C1SADR_SADR_MASK                                 0x7F

// Register: I3C1DADR
#define I3C1DADR I3C1DADR
extern volatile unsigned char           I3C1DADR            __at(0x09B);
#ifndef _LIB_BUILD
asm("I3C1DADR equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DADR                   :7;
    };
} I3C1DADRbits_t;
extern volatile I3C1DADRbits_t I3C1DADRbits __at(0x09B);
// bitfield macros
#define _I3C1DADR_DADR_POSN                                 0x0
#define _I3C1DADR_DADR_POSITION                             0x0
#define _I3C1DADR_DADR_SIZE                                 0x7
#define _I3C1DADR_DADR_LENGTH                               0x7
#define _I3C1DADR_DADR_MASK                                 0x7F

// Register: I3C1EC
#define I3C1EC I3C1EC
extern volatile unsigned char           I3C1EC              __at(0x09C);
#ifndef _LIB_BUILD
asm("I3C1EC equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIEN                  :1;
        unsigned CREN                   :1;
        unsigned EC2                    :1;
        unsigned HJEN                   :1;
        unsigned EC_7_4                 :4;
    };
} I3C1ECbits_t;
extern volatile I3C1ECbits_t I3C1ECbits __at(0x09C);
// bitfield macros
#define _I3C1EC_IBIEN_POSN                                  0x0
#define _I3C1EC_IBIEN_POSITION                              0x0
#define _I3C1EC_IBIEN_SIZE                                  0x1
#define _I3C1EC_IBIEN_LENGTH                                0x1
#define _I3C1EC_IBIEN_MASK                                  0x1
#define _I3C1EC_CREN_POSN                                   0x1
#define _I3C1EC_CREN_POSITION                               0x1
#define _I3C1EC_CREN_SIZE                                   0x1
#define _I3C1EC_CREN_LENGTH                                 0x1
#define _I3C1EC_CREN_MASK                                   0x2
#define _I3C1EC_EC2_POSN                                    0x2
#define _I3C1EC_EC2_POSITION                                0x2
#define _I3C1EC_EC2_SIZE                                    0x1
#define _I3C1EC_EC2_LENGTH                                  0x1
#define _I3C1EC_EC2_MASK                                    0x4
#define _I3C1EC_HJEN_POSN                                   0x3
#define _I3C1EC_HJEN_POSITION                               0x3
#define _I3C1EC_HJEN_SIZE                                   0x1
#define _I3C1EC_HJEN_LENGTH                                 0x1
#define _I3C1EC_HJEN_MASK                                   0x8
#define _I3C1EC_EC_7_4_POSN                                 0x4
#define _I3C1EC_EC_7_4_POSITION                             0x4
#define _I3C1EC_EC_7_4_SIZE                                 0x4
#define _I3C1EC_EC_7_4_LENGTH                               0x4
#define _I3C1EC_EC_7_4_MASK                                 0xF0

// Register: I3C1MWL
#define I3C1MWL I3C1MWL
extern volatile unsigned short          I3C1MWL             __at(0x09D);
#ifndef _LIB_BUILD
asm("I3C1MWL equ 09Dh");
#endif

// Register: I3C1MWLL
#define I3C1MWLL I3C1MWLL
extern volatile unsigned char           I3C1MWLL            __at(0x09D);
#ifndef _LIB_BUILD
asm("I3C1MWLL equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MWLL                   :8;
    };
} I3C1MWLLbits_t;
extern volatile I3C1MWLLbits_t I3C1MWLLbits __at(0x09D);
// bitfield macros
#define _I3C1MWLL_MWLL_POSN                                 0x0
#define _I3C1MWLL_MWLL_POSITION                             0x0
#define _I3C1MWLL_MWLL_SIZE                                 0x8
#define _I3C1MWLL_MWLL_LENGTH                               0x8
#define _I3C1MWLL_MWLL_MASK                                 0xFF

// Register: I3C1MWLH
#define I3C1MWLH I3C1MWLH
extern volatile unsigned char           I3C1MWLH            __at(0x09E);
#ifndef _LIB_BUILD
asm("I3C1MWLH equ 09Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MWLH                   :8;
    };
} I3C1MWLHbits_t;
extern volatile I3C1MWLHbits_t I3C1MWLHbits __at(0x09E);
// bitfield macros
#define _I3C1MWLH_MWLH_POSN                                 0x0
#define _I3C1MWLH_MWLH_POSITION                             0x0
#define _I3C1MWLH_MWLH_SIZE                                 0x8
#define _I3C1MWLH_MWLH_LENGTH                               0x8
#define _I3C1MWLH_MWLH_MASK                                 0xFF

// Register: I3C1MRL
#define I3C1MRL I3C1MRL
extern volatile unsigned short          I3C1MRL             __at(0x09F);
#ifndef _LIB_BUILD
asm("I3C1MRL equ 09Fh");
#endif

// Register: I3C1MRLL
#define I3C1MRLL I3C1MRLL
extern volatile unsigned char           I3C1MRLL            __at(0x09F);
#ifndef _LIB_BUILD
asm("I3C1MRLL equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRLL                   :8;
    };
} I3C1MRLLbits_t;
extern volatile I3C1MRLLbits_t I3C1MRLLbits __at(0x09F);
// bitfield macros
#define _I3C1MRLL_MRLL_POSN                                 0x0
#define _I3C1MRLL_MRLL_POSITION                             0x0
#define _I3C1MRLL_MRLL_SIZE                                 0x8
#define _I3C1MRLL_MRLL_LENGTH                               0x8
#define _I3C1MRLL_MRLL_MASK                                 0xFF

// Register: I3C1MRLH
#define I3C1MRLH I3C1MRLH
extern volatile unsigned char           I3C1MRLH            __at(0x0A0);
#ifndef _LIB_BUILD
asm("I3C1MRLH equ 0A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRLH                   :8;
    };
} I3C1MRLHbits_t;
extern volatile I3C1MRLHbits_t I3C1MRLHbits __at(0x0A0);
// bitfield macros
#define _I3C1MRLH_MRLH_POSN                                 0x0
#define _I3C1MRLH_MRLH_POSITION                             0x0
#define _I3C1MRLH_MRLH_SIZE                                 0x8
#define _I3C1MRLH_MRLH_LENGTH                               0x8
#define _I3C1MRLH_MRLH_MASK                                 0xFF

// Register: I3C1IBIPSZ
#define I3C1IBIPSZ I3C1IBIPSZ
extern volatile unsigned char           I3C1IBIPSZ          __at(0x0A1);
#ifndef _LIB_BUILD
asm("I3C1IBIPSZ equ 0A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIPSZ                 :8;
    };
} I3C1IBIPSZbits_t;
extern volatile I3C1IBIPSZbits_t I3C1IBIPSZbits __at(0x0A1);
// bitfield macros
#define _I3C1IBIPSZ_IBIPSZ_POSN                             0x0
#define _I3C1IBIPSZ_IBIPSZ_POSITION                         0x0
#define _I3C1IBIPSZ_IBIPSZ_SIZE                             0x8
#define _I3C1IBIPSZ_IBIPSZ_LENGTH                           0x8
#define _I3C1IBIPSZ_IBIPSZ_MASK                             0xFF

// Register: I3C1PID0
#define I3C1PID0 I3C1PID0
extern volatile unsigned char           I3C1PID0            __at(0x0A2);
#ifndef _LIB_BUILD
asm("I3C1PID0 equ 0A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID0                   :1;
        unsigned PID1                   :1;
        unsigned PID2                   :1;
        unsigned PID3                   :1;
        unsigned PID4                   :1;
        unsigned PID5                   :1;
        unsigned PID6                   :1;
        unsigned PID7                   :1;
    };
    struct {
        unsigned PID_7_0                :8;
    };
} I3C1PID0bits_t;
extern volatile I3C1PID0bits_t I3C1PID0bits __at(0x0A2);
// bitfield macros
#define _I3C1PID0_PID0_POSN                                 0x0
#define _I3C1PID0_PID0_POSITION                             0x0
#define _I3C1PID0_PID0_SIZE                                 0x1
#define _I3C1PID0_PID0_LENGTH                               0x1
#define _I3C1PID0_PID0_MASK                                 0x1
#define _I3C1PID0_PID1_POSN                                 0x1
#define _I3C1PID0_PID1_POSITION                             0x1
#define _I3C1PID0_PID1_SIZE                                 0x1
#define _I3C1PID0_PID1_LENGTH                               0x1
#define _I3C1PID0_PID1_MASK                                 0x2
#define _I3C1PID0_PID2_POSN                                 0x2
#define _I3C1PID0_PID2_POSITION                             0x2
#define _I3C1PID0_PID2_SIZE                                 0x1
#define _I3C1PID0_PID2_LENGTH                               0x1
#define _I3C1PID0_PID2_MASK                                 0x4
#define _I3C1PID0_PID3_POSN                                 0x3
#define _I3C1PID0_PID3_POSITION                             0x3
#define _I3C1PID0_PID3_SIZE                                 0x1
#define _I3C1PID0_PID3_LENGTH                               0x1
#define _I3C1PID0_PID3_MASK                                 0x8
#define _I3C1PID0_PID4_POSN                                 0x4
#define _I3C1PID0_PID4_POSITION                             0x4
#define _I3C1PID0_PID4_SIZE                                 0x1
#define _I3C1PID0_PID4_LENGTH                               0x1
#define _I3C1PID0_PID4_MASK                                 0x10
#define _I3C1PID0_PID5_POSN                                 0x5
#define _I3C1PID0_PID5_POSITION                             0x5
#define _I3C1PID0_PID5_SIZE                                 0x1
#define _I3C1PID0_PID5_LENGTH                               0x1
#define _I3C1PID0_PID5_MASK                                 0x20
#define _I3C1PID0_PID6_POSN                                 0x6
#define _I3C1PID0_PID6_POSITION                             0x6
#define _I3C1PID0_PID6_SIZE                                 0x1
#define _I3C1PID0_PID6_LENGTH                               0x1
#define _I3C1PID0_PID6_MASK                                 0x40
#define _I3C1PID0_PID7_POSN                                 0x7
#define _I3C1PID0_PID7_POSITION                             0x7
#define _I3C1PID0_PID7_SIZE                                 0x1
#define _I3C1PID0_PID7_LENGTH                               0x1
#define _I3C1PID0_PID7_MASK                                 0x80
#define _I3C1PID0_PID_7_0_POSN                              0x0
#define _I3C1PID0_PID_7_0_POSITION                          0x0
#define _I3C1PID0_PID_7_0_SIZE                              0x8
#define _I3C1PID0_PID_7_0_LENGTH                            0x8
#define _I3C1PID0_PID_7_0_MASK                              0xFF

// Register: I3C1PID1
#define I3C1PID1 I3C1PID1
extern volatile unsigned char           I3C1PID1            __at(0x0A3);
#ifndef _LIB_BUILD
asm("I3C1PID1 equ 0A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID8                   :1;
        unsigned PID9                   :1;
        unsigned PID10                  :1;
        unsigned PID11                  :1;
        unsigned PID12                  :1;
        unsigned PID13                  :1;
        unsigned PID14                  :1;
        unsigned PID15                  :1;
    };
    struct {
        unsigned PID_11_8               :4;
        unsigned PID_15_12              :4;
    };
} I3C1PID1bits_t;
extern volatile I3C1PID1bits_t I3C1PID1bits __at(0x0A3);
// bitfield macros
#define _I3C1PID1_PID8_POSN                                 0x0
#define _I3C1PID1_PID8_POSITION                             0x0
#define _I3C1PID1_PID8_SIZE                                 0x1
#define _I3C1PID1_PID8_LENGTH                               0x1
#define _I3C1PID1_PID8_MASK                                 0x1
#define _I3C1PID1_PID9_POSN                                 0x1
#define _I3C1PID1_PID9_POSITION                             0x1
#define _I3C1PID1_PID9_SIZE                                 0x1
#define _I3C1PID1_PID9_LENGTH                               0x1
#define _I3C1PID1_PID9_MASK                                 0x2
#define _I3C1PID1_PID10_POSN                                0x2
#define _I3C1PID1_PID10_POSITION                            0x2
#define _I3C1PID1_PID10_SIZE                                0x1
#define _I3C1PID1_PID10_LENGTH                              0x1
#define _I3C1PID1_PID10_MASK                                0x4
#define _I3C1PID1_PID11_POSN                                0x3
#define _I3C1PID1_PID11_POSITION                            0x3
#define _I3C1PID1_PID11_SIZE                                0x1
#define _I3C1PID1_PID11_LENGTH                              0x1
#define _I3C1PID1_PID11_MASK                                0x8
#define _I3C1PID1_PID12_POSN                                0x4
#define _I3C1PID1_PID12_POSITION                            0x4
#define _I3C1PID1_PID12_SIZE                                0x1
#define _I3C1PID1_PID12_LENGTH                              0x1
#define _I3C1PID1_PID12_MASK                                0x10
#define _I3C1PID1_PID13_POSN                                0x5
#define _I3C1PID1_PID13_POSITION                            0x5
#define _I3C1PID1_PID13_SIZE                                0x1
#define _I3C1PID1_PID13_LENGTH                              0x1
#define _I3C1PID1_PID13_MASK                                0x20
#define _I3C1PID1_PID14_POSN                                0x6
#define _I3C1PID1_PID14_POSITION                            0x6
#define _I3C1PID1_PID14_SIZE                                0x1
#define _I3C1PID1_PID14_LENGTH                              0x1
#define _I3C1PID1_PID14_MASK                                0x40
#define _I3C1PID1_PID15_POSN                                0x7
#define _I3C1PID1_PID15_POSITION                            0x7
#define _I3C1PID1_PID15_SIZE                                0x1
#define _I3C1PID1_PID15_LENGTH                              0x1
#define _I3C1PID1_PID15_MASK                                0x80
#define _I3C1PID1_PID_11_8_POSN                             0x0
#define _I3C1PID1_PID_11_8_POSITION                         0x0
#define _I3C1PID1_PID_11_8_SIZE                             0x4
#define _I3C1PID1_PID_11_8_LENGTH                           0x4
#define _I3C1PID1_PID_11_8_MASK                             0xF
#define _I3C1PID1_PID_15_12_POSN                            0x4
#define _I3C1PID1_PID_15_12_POSITION                        0x4
#define _I3C1PID1_PID_15_12_SIZE                            0x4
#define _I3C1PID1_PID_15_12_LENGTH                          0x4
#define _I3C1PID1_PID_15_12_MASK                            0xF0

// Register: I3C1PID2
#define I3C1PID2 I3C1PID2
extern volatile unsigned char           I3C1PID2            __at(0x0A4);
#ifndef _LIB_BUILD
asm("I3C1PID2 equ 0A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID16                  :1;
        unsigned PID17                  :1;
        unsigned PID18                  :1;
        unsigned PID19                  :1;
        unsigned PID20                  :1;
        unsigned PID21                  :1;
        unsigned PID22                  :1;
        unsigned PID23                  :1;
    };
    struct {
        unsigned PID_23_16              :8;
    };
} I3C1PID2bits_t;
extern volatile I3C1PID2bits_t I3C1PID2bits __at(0x0A4);
// bitfield macros
#define _I3C1PID2_PID16_POSN                                0x0
#define _I3C1PID2_PID16_POSITION                            0x0
#define _I3C1PID2_PID16_SIZE                                0x1
#define _I3C1PID2_PID16_LENGTH                              0x1
#define _I3C1PID2_PID16_MASK                                0x1
#define _I3C1PID2_PID17_POSN                                0x1
#define _I3C1PID2_PID17_POSITION                            0x1
#define _I3C1PID2_PID17_SIZE                                0x1
#define _I3C1PID2_PID17_LENGTH                              0x1
#define _I3C1PID2_PID17_MASK                                0x2
#define _I3C1PID2_PID18_POSN                                0x2
#define _I3C1PID2_PID18_POSITION                            0x2
#define _I3C1PID2_PID18_SIZE                                0x1
#define _I3C1PID2_PID18_LENGTH                              0x1
#define _I3C1PID2_PID18_MASK                                0x4
#define _I3C1PID2_PID19_POSN                                0x3
#define _I3C1PID2_PID19_POSITION                            0x3
#define _I3C1PID2_PID19_SIZE                                0x1
#define _I3C1PID2_PID19_LENGTH                              0x1
#define _I3C1PID2_PID19_MASK                                0x8
#define _I3C1PID2_PID20_POSN                                0x4
#define _I3C1PID2_PID20_POSITION                            0x4
#define _I3C1PID2_PID20_SIZE                                0x1
#define _I3C1PID2_PID20_LENGTH                              0x1
#define _I3C1PID2_PID20_MASK                                0x10
#define _I3C1PID2_PID21_POSN                                0x5
#define _I3C1PID2_PID21_POSITION                            0x5
#define _I3C1PID2_PID21_SIZE                                0x1
#define _I3C1PID2_PID21_LENGTH                              0x1
#define _I3C1PID2_PID21_MASK                                0x20
#define _I3C1PID2_PID22_POSN                                0x6
#define _I3C1PID2_PID22_POSITION                            0x6
#define _I3C1PID2_PID22_SIZE                                0x1
#define _I3C1PID2_PID22_LENGTH                              0x1
#define _I3C1PID2_PID22_MASK                                0x40
#define _I3C1PID2_PID23_POSN                                0x7
#define _I3C1PID2_PID23_POSITION                            0x7
#define _I3C1PID2_PID23_SIZE                                0x1
#define _I3C1PID2_PID23_LENGTH                              0x1
#define _I3C1PID2_PID23_MASK                                0x80
#define _I3C1PID2_PID_23_16_POSN                            0x0
#define _I3C1PID2_PID_23_16_POSITION                        0x0
#define _I3C1PID2_PID_23_16_SIZE                            0x8
#define _I3C1PID2_PID_23_16_LENGTH                          0x8
#define _I3C1PID2_PID_23_16_MASK                            0xFF

// Register: I3C1PID3
#define I3C1PID3 I3C1PID3
extern volatile unsigned char           I3C1PID3            __at(0x0A5);
#ifndef _LIB_BUILD
asm("I3C1PID3 equ 0A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID24                  :1;
        unsigned PID25                  :1;
        unsigned PID26                  :1;
        unsigned PID27                  :1;
        unsigned PID28                  :1;
        unsigned PID29                  :1;
        unsigned PID30                  :1;
        unsigned PID31                  :1;
    };
    struct {
        unsigned PID_31_24              :8;
    };
} I3C1PID3bits_t;
