garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile I3C1PID3bits_t I3C1PID3bits __at(0x0A5);
// bitfield macros
#define _I3C1PID3_PID24_POSN                                0x0
#define _I3C1PID3_PID24_POSITION                            0x0
#define _I3C1PID3_PID24_SIZE                                0x1
#define _I3C1PID3_PID24_LENGTH                              0x1
#define _I3C1PID3_PID24_MASK                                0x1
#define _I3C1PID3_PID25_POSN                                0x1
#define _I3C1PID3_PID25_POSITION                            0x1
#define _I3C1PID3_PID25_SIZE                                0x1
#define _I3C1PID3_PID25_LENGTH                              0x1
#define _I3C1PID3_PID25_MASK                                0x2
#define _I3C1PID3_PID26_POSN                                0x2
#define _I3C1PID3_PID26_POSITION                            0x2
#define _I3C1PID3_PID26_SIZE                                0x1
#define _I3C1PID3_PID26_LENGTH                              0x1
#define _I3C1PID3_PID26_MASK                                0x4
#define _I3C1PID3_PID27_POSN                                0x3
#define _I3C1PID3_PID27_POSITION                            0x3
#define _I3C1PID3_PID27_SIZE                                0x1
#define _I3C1PID3_PID27_LENGTH                              0x1
#define _I3C1PID3_PID27_MASK                                0x8
#define _I3C1PID3_PID28_POSN                                0x4
#define _I3C1PID3_PID28_POSITION                            0x4
#define _I3C1PID3_PID28_SIZE                                0x1
#define _I3C1PID3_PID28_LENGTH                              0x1
#define _I3C1PID3_PID28_MASK                                0x10
#define _I3C1PID3_PID29_POSN                                0x5
#define _I3C1PID3_PID29_POSITION                            0x5
#define _I3C1PID3_PID29_SIZE                                0x1
#define _I3C1PID3_PID29_LENGTH                              0x1
#define _I3C1PID3_PID29_MASK                                0x20
#define _I3C1PID3_PID30_POSN                                0x6
#define _I3C1PID3_PID30_POSITION                            0x6
#define _I3C1PID3_PID30_SIZE                                0x1
#define _I3C1PID3_PID30_LENGTH                              0x1
#define _I3C1PID3_PID30_MASK                                0x40
#define _I3C1PID3_PID31_POSN                                0x7
#define _I3C1PID3_PID31_POSITION                            0x7
#define _I3C1PID3_PID31_SIZE                                0x1
#define _I3C1PID3_PID31_LENGTH                              0x1
#define _I3C1PID3_PID31_MASK                                0x80
#define _I3C1PID3_PID_31_24_POSN                            0x0
#define _I3C1PID3_PID_31_24_POSITION                        0x0
#define _I3C1PID3_PID_31_24_SIZE                            0x8
#define _I3C1PID3_PID_31_24_LENGTH                          0x8
#define _I3C1PID3_PID_31_24_MASK                            0xFF

// Register: I3C1PID4
#define I3C1PID4 I3C1PID4
extern volatile unsigned char           I3C1PID4            __at(0x0A6);
#ifndef _LIB_BUILD
asm("I3C1PID4 equ 0A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID32                  :1;
        unsigned PID33                  :1;
        unsigned PID34                  :1;
        unsigned PID35                  :1;
        unsigned PID36                  :1;
        unsigned PID37                  :1;
        unsigned PID38                  :1;
        unsigned PID39                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned PID_39_33              :7;
    };
} I3C1PID4bits_t;
extern volatile I3C1PID4bits_t I3C1PID4bits __at(0x0A6);
// bitfield macros
#define _I3C1PID4_PID32_POSN                                0x0
#define _I3C1PID4_PID32_POSITION                            0x0
#define _I3C1PID4_PID32_SIZE                                0x1
#define _I3C1PID4_PID32_LENGTH                              0x1
#define _I3C1PID4_PID32_MASK                                0x1
#define _I3C1PID4_PID33_POSN                                0x1
#define _I3C1PID4_PID33_POSITION                            0x1
#define _I3C1PID4_PID33_SIZE                                0x1
#define _I3C1PID4_PID33_LENGTH                              0x1
#define _I3C1PID4_PID33_MASK                                0x2
#define _I3C1PID4_PID34_POSN                                0x2
#define _I3C1PID4_PID34_POSITION                            0x2
#define _I3C1PID4_PID34_SIZE                                0x1
#define _I3C1PID4_PID34_LENGTH                              0x1
#define _I3C1PID4_PID34_MASK                                0x4
#define _I3C1PID4_PID35_POSN                                0x3
#define _I3C1PID4_PID35_POSITION                            0x3
#define _I3C1PID4_PID35_SIZE                                0x1
#define _I3C1PID4_PID35_LENGTH                              0x1
#define _I3C1PID4_PID35_MASK                                0x8
#define _I3C1PID4_PID36_POSN                                0x4
#define _I3C1PID4_PID36_POSITION                            0x4
#define _I3C1PID4_PID36_SIZE                                0x1
#define _I3C1PID4_PID36_LENGTH                              0x1
#define _I3C1PID4_PID36_MASK                                0x10
#define _I3C1PID4_PID37_POSN                                0x5
#define _I3C1PID4_PID37_POSITION                            0x5
#define _I3C1PID4_PID37_SIZE                                0x1
#define _I3C1PID4_PID37_LENGTH                              0x1
#define _I3C1PID4_PID37_MASK                                0x20
#define _I3C1PID4_PID38_POSN                                0x6
#define _I3C1PID4_PID38_POSITION                            0x6
#define _I3C1PID4_PID38_SIZE                                0x1
#define _I3C1PID4_PID38_LENGTH                              0x1
#define _I3C1PID4_PID38_MASK                                0x40
#define _I3C1PID4_PID39_POSN                                0x7
#define _I3C1PID4_PID39_POSITION                            0x7
#define _I3C1PID4_PID39_SIZE                                0x1
#define _I3C1PID4_PID39_LENGTH                              0x1
#define _I3C1PID4_PID39_MASK                                0x80
#define _I3C1PID4_PID_39_33_POSN                            0x1
#define _I3C1PID4_PID_39_33_POSITION                        0x1
#define _I3C1PID4_PID_39_33_SIZE                            0x7
#define _I3C1PID4_PID_39_33_LENGTH                          0x7
#define _I3C1PID4_PID_39_33_MASK                            0xFE

// Register: I3C1PID5
#define I3C1PID5 I3C1PID5
extern volatile unsigned char           I3C1PID5            __at(0x0A7);
#ifndef _LIB_BUILD
asm("I3C1PID5 equ 0A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID40                  :1;
        unsigned PID41                  :1;
        unsigned PID42                  :1;
        unsigned PID43                  :1;
        unsigned PID44                  :1;
        unsigned PID45                  :1;
        unsigned PID46                  :1;
        unsigned PID47                  :1;
    };
    struct {
        unsigned PID_47_40              :8;
    };
} I3C1PID5bits_t;
extern volatile I3C1PID5bits_t I3C1PID5bits __at(0x0A7);
// bitfield macros
#define _I3C1PID5_PID40_POSN                                0x0
#define _I3C1PID5_PID40_POSITION                            0x0
#define _I3C1PID5_PID40_SIZE                                0x1
#define _I3C1PID5_PID40_LENGTH                              0x1
#define _I3C1PID5_PID40_MASK                                0x1
#define _I3C1PID5_PID41_POSN                                0x1
#define _I3C1PID5_PID41_POSITION                            0x1
#define _I3C1PID5_PID41_SIZE                                0x1
#define _I3C1PID5_PID41_LENGTH                              0x1
#define _I3C1PID5_PID41_MASK                                0x2
#define _I3C1PID5_PID42_POSN                                0x2
#define _I3C1PID5_PID42_POSITION                            0x2
#define _I3C1PID5_PID42_SIZE                                0x1
#define _I3C1PID5_PID42_LENGTH                              0x1
#define _I3C1PID5_PID42_MASK                                0x4
#define _I3C1PID5_PID43_POSN                                0x3
#define _I3C1PID5_PID43_POSITION                            0x3
#define _I3C1PID5_PID43_SIZE                                0x1
#define _I3C1PID5_PID43_LENGTH                              0x1
#define _I3C1PID5_PID43_MASK                                0x8
#define _I3C1PID5_PID44_POSN                                0x4
#define _I3C1PID5_PID44_POSITION                            0x4
#define _I3C1PID5_PID44_SIZE                                0x1
#define _I3C1PID5_PID44_LENGTH                              0x1
#define _I3C1PID5_PID44_MASK                                0x10
#define _I3C1PID5_PID45_POSN                                0x5
#define _I3C1PID5_PID45_POSITION                            0x5
#define _I3C1PID5_PID45_SIZE                                0x1
#define _I3C1PID5_PID45_LENGTH                              0x1
#define _I3C1PID5_PID45_MASK                                0x20
#define _I3C1PID5_PID46_POSN                                0x6
#define _I3C1PID5_PID46_POSITION                            0x6
#define _I3C1PID5_PID46_SIZE                                0x1
#define _I3C1PID5_PID46_LENGTH                              0x1
#define _I3C1PID5_PID46_MASK                                0x40
#define _I3C1PID5_PID47_POSN                                0x7
#define _I3C1PID5_PID47_POSITION                            0x7
#define _I3C1PID5_PID47_SIZE                                0x1
#define _I3C1PID5_PID47_LENGTH                              0x1
#define _I3C1PID5_PID47_MASK                                0x80
#define _I3C1PID5_PID_47_40_POSN                            0x0
#define _I3C1PID5_PID_47_40_POSITION                        0x0
#define _I3C1PID5_PID_47_40_SIZE                            0x8
#define _I3C1PID5_PID_47_40_LENGTH                          0x8
#define _I3C1PID5_PID_47_40_MASK                            0xFF

// Register: I3C1BCR
#define I3C1BCR I3C1BCR
extern volatile unsigned char           I3C1BCR             __at(0x0A8);
#ifndef _LIB_BUILD
asm("I3C1BCR equ 0A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BCR0                   :1;
        unsigned BCR1                   :1;
        unsigned BCR2                   :1;
        unsigned BCR3                   :1;
        unsigned BCR4                   :1;
        unsigned BCR5                   :1;
        unsigned BCR6                   :1;
        unsigned BCR7                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned BCR_7_6                :2;
    };
} I3C1BCRbits_t;
extern volatile I3C1BCRbits_t I3C1BCRbits __at(0x0A8);
// bitfield macros
#define _I3C1BCR_BCR0_POSN                                  0x0
#define _I3C1BCR_BCR0_POSITION                              0x0
#define _I3C1BCR_BCR0_SIZE                                  0x1
#define _I3C1BCR_BCR0_LENGTH                                0x1
#define _I3C1BCR_BCR0_MASK                                  0x1
#define _I3C1BCR_BCR1_POSN                                  0x1
#define _I3C1BCR_BCR1_POSITION                              0x1
#define _I3C1BCR_BCR1_SIZE                                  0x1
#define _I3C1BCR_BCR1_LENGTH                                0x1
#define _I3C1BCR_BCR1_MASK                                  0x2
#define _I3C1BCR_BCR2_POSN                                  0x2
#define _I3C1BCR_BCR2_POSITION                              0x2
#define _I3C1BCR_BCR2_SIZE                                  0x1
#define _I3C1BCR_BCR2_LENGTH                                0x1
#define _I3C1BCR_BCR2_MASK                                  0x4
#define _I3C1BCR_BCR3_POSN                                  0x3
#define _I3C1BCR_BCR3_POSITION                              0x3
#define _I3C1BCR_BCR3_SIZE                                  0x1
#define _I3C1BCR_BCR3_LENGTH                                0x1
#define _I3C1BCR_BCR3_MASK                                  0x8
#define _I3C1BCR_BCR4_POSN                                  0x4
#define _I3C1BCR_BCR4_POSITION                              0x4
#define _I3C1BCR_BCR4_SIZE                                  0x1
#define _I3C1BCR_BCR4_LENGTH                                0x1
#define _I3C1BCR_BCR4_MASK                                  0x10
#define _I3C1BCR_BCR5_POSN                                  0x5
#define _I3C1BCR_BCR5_POSITION                              0x5
#define _I3C1BCR_BCR5_SIZE                                  0x1
#define _I3C1BCR_BCR5_LENGTH                                0x1
#define _I3C1BCR_BCR5_MASK                                  0x20
#define _I3C1BCR_BCR6_POSN                                  0x6
#define _I3C1BCR_BCR6_POSITION                              0x6
#define _I3C1BCR_BCR6_SIZE                                  0x1
#define _I3C1BCR_BCR6_LENGTH                                0x1
#define _I3C1BCR_BCR6_MASK                                  0x40
#define _I3C1BCR_BCR7_POSN                                  0x7
#define _I3C1BCR_BCR7_POSITION                              0x7
#define _I3C1BCR_BCR7_SIZE                                  0x1
#define _I3C1BCR_BCR7_LENGTH                                0x1
#define _I3C1BCR_BCR7_MASK                                  0x80
#define _I3C1BCR_BCR_7_6_POSN                               0x6
#define _I3C1BCR_BCR_7_6_POSITION                           0x6
#define _I3C1BCR_BCR_7_6_SIZE                               0x2
#define _I3C1BCR_BCR_7_6_LENGTH                             0x2
#define _I3C1BCR_BCR_7_6_MASK                               0xC0

