garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
// Register: I3C1MRTL
#define I3C1MRTL I3C1MRTL
extern volatile unsigned char           I3C1MRTL            __at(0x0AE);
#ifndef _LIB_BUILD
asm("I3C1MRTL equ 0AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRTL                   :8;
    };
} I3C1MRTLbits_t;
extern volatile I3C1MRTLbits_t I3C1MRTLbits __at(0x0AE);
// bitfield macros
#define _I3C1MRTL_MRTL_POSN                                 0x0
#define _I3C1MRTL_MRTL_POSITION                             0x0
#define _I3C1MRTL_MRTL_SIZE                                 0x8
#define _I3C1MRTL_MRTL_LENGTH                               0x8
#define _I3C1MRTL_MRTL_MASK                                 0xFF

// Register: I3C1MRTH
#define I3C1MRTH I3C1MRTH
extern volatile unsigned char           I3C1MRTH            __at(0x0AF);
#ifndef _LIB_BUILD
asm("I3C1MRTH equ 0AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRTH                   :8;
    };
} I3C1MRTHbits_t;
extern volatile I3C1MRTHbits_t I3C1MRTHbits __at(0x0AF);
// bitfield macros
#define _I3C1MRTH_MRTH_POSN                                 0x0
#define _I3C1MRTH_MRTH_POSITION                             0x0
#define _I3C1MRTH_MRTH_SIZE                                 0x8
#define _I3C1MRTH_MRTH_LENGTH                               0x8
#define _I3C1MRTH_MRTH_MASK                                 0xFF

// Register: I3C1MRTU
#define I3C1MRTU I3C1MRTU
extern volatile unsigned char           I3C1MRTU            __at(0x0B0);
#ifndef _LIB_BUILD
asm("I3C1MRTU equ 0B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRTU                   :8;
    };
} I3C1MRTUbits_t;
extern volatile I3C1MRTUbits_t I3C1MRTUbits __at(0x0B0);
// bitfield macros
#define _I3C1MRTU_MRTU_POSN                                 0x0
#define _I3C1MRTU_MRTU_POSITION                             0x0
#define _I3C1MRTU_MRTU_SIZE                                 0x8
#define _I3C1MRTU_MRTU_LENGTH                               0x8
#define _I3C1MRTU_MRTU_MASK                                 0xFF

// Register: I3C1RSTACT
#define I3C1RSTACT I3C1RSTACT
extern volatile unsigned char           I3C1RSTACT          __at(0x0B1);
#ifndef _LIB_BUILD
asm("I3C1RSTACT equ 0B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSTACT                 :8;
    };
} I3C1RSTACTbits_t;
extern volatile I3C1RSTACTbits_t I3C1RSTACTbits __at(0x0B1);
// bitfield macros
#define _I3C1RSTACT_RSTACT_POSN                             0x0
#define _I3C1RSTACT_RSTACT_POSITION                         0x0
#define _I3C1RSTACT_RSTACT_SIZE                             0x8
#define _I3C1RSTACT_RSTACT_LENGTH                           0x8
#define _I3C1RSTACT_RSTACT_MASK                             0xFF

// Register: I3C1BUSCXT
#define I3C1BUSCXT I3C1BUSCXT
extern volatile unsigned char           I3C1BUSCXT          __at(0x0B2);
#ifndef _LIB_BUILD
asm("I3C1BUSCXT equ 0B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUSCXT                 :8;
    };
} I3C1BUSCXTbits_t;
extern volatile I3C1BUSCXTbits_t I3C1BUSCXTbits __at(0x0B2);
// bitfield macros
#define _I3C1BUSCXT_BUSCXT_POSN                             0x0
#define _I3C1BUSCXT_BUSCXT_POSITION                         0x0
#define _I3C1BUSCXT_BUSCXT_SIZE                             0x8
#define _I3C1BUSCXT_BUSCXT_LENGTH                           0x8
#define _I3C1BUSCXT_BUSCXT_MASK                             0xFF

// Register: I3C1CCC
#define I3C1CCC I3C1CCC
extern volatile unsigned char           I3C1CCC             __at(0x0B3);
#ifndef _LIB_BUILD
asm("I3C1CCC equ 0B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCC                    :8;
    };
} I3C1CCCbits_t;
extern volatile I3C1CCCbits_t I3C1CCCbits __at(0x0B3);
// bitfield macros
#define _I3C1CCC_CCC_POSN                                   0x0
#define _I3C1CCC_CCC_POSITION                               0x0
#define _I3C1CCC_CCC_SIZE                                   0x8
#define _I3C1CCC_CCC_LENGTH                                 0x8
#define _I3C1CCC_CCC_MASK                                   0xFF

// Register: I3C1I2CCON
#define I3C1I2CCON I3C1I2CCON
extern volatile unsigned char           I3C1I2CCON          __at(0x0B4);
#ifndef _LIB_BUILD
asm("I3C1I2CCON equ 0B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SDAHT                  :2;
        unsigned FLTEN                  :1;
    };
} I3C1I2CCONbits_t;
extern volatile I3C1I2CCONbits_t I3C1I2CCONbits __at(0x0B4);
// bitfield macros
#define _I3C1I2CCON_SDAHT_POSN                              0x0
#define _I3C1I2CCON_SDAHT_POSITION                          0x0
#define _I3C1I2CCON_SDAHT_SIZE                              0x2
#define _I3C1I2CCON_SDAHT_LENGTH                            0x2
#define _I3C1I2CCON_SDAHT_MASK                              0x3
#define _I3C1I2CCON_FLTEN_POSN                              0x2
#define _I3C1I2CCON_FLTEN_POSITION                          0x2
#define _I3C1I2CCON_FLTEN_SIZE                              0x1
#define _I3C1I2CCON_FLTEN_LENGTH                            0x1
#define _I3C1I2CCON_FLTEN_MASK                              0x4

// Register: I3C1CLK
#define I3C1CLK I3C1CLK
extern volatile unsigned char           I3C1CLK             __at(0x0B5);
#ifndef _LIB_BUILD
asm("I3C1CLK equ 0B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} I3C1CLKbits_t;
extern volatile I3C1CLKbits_t I3C1CLKbits __at(0x0B5);
// bitfield macros
#define _I3C1CLK_CLK_POSN                                   0x0
#define _I3C1CLK_CLK_POSITION                               0x0
#define _I3C1CLK_CLK_SIZE                                   0x8
#define _I3C1CLK_CLK_LENGTH                                 0x8
#define _I3C1CLK_CLK_MASK                                   0xFF
#define _I3C1CLK_CLK0_POSN                                  0x0
#define _I3C1CLK_CLK0_POSITION                              0x0
#define _I3C1CLK_CLK0_SIZE                                  0x1
#define _I3C1CLK_CLK0_LENGTH                                0x1
#define _I3C1CLK_CLK0_MASK                                  0x1
#define _I3C1CLK_CLK1_POSN                                  0x1
#define _I3C1CLK_CLK1_POSITION                              0x1
#define _I3C1CLK_CLK1_SIZE                                  0x1
#define _I3C1CLK_CLK1_LENGTH                                0x1
#define _I3C1CLK_CLK1_MASK                                  0x2
#define _I3C1CLK_CLK2_POSN                                  0x2
#define _I3C1CLK_CLK2_POSITION                              0x2
#define _I3C1CLK_CLK2_SIZE                                  0x1
#define _I3C1CLK_CLK2_LENGTH                                0x1
#define _I3C1CLK_CLK2_MASK                                  0x4
#define _I3C1CLK_CLK3_POSN                                  0x3
#define _I3C1CLK_CLK3_POSITION                              0x3
#define _I3C1CLK_CLK3_SIZE                                  0x1
#define _I3C1CLK_CLK3_LENGTH                                0x1
#define _I3C1CLK_CLK3_MASK                                  0x8

