garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
// Register: I3C2BCR
#define I3C2BCR I3C2BCR
extern volatile unsigned char           I3C2BCR             __at(0x0DB);
#ifndef _LIB_BUILD
asm("I3C2BCR equ 0DBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BCR0                   :1;
        unsigned BCR1                   :1;
        unsigned BCR2                   :1;
        unsigned BCR3                   :1;
        unsigned BCR4                   :1;
        unsigned BCR5                   :1;
        unsigned BCR6                   :1;
        unsigned BCR7                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned BCR_7_6                :2;
    };
} I3C2BCRbits_t;
extern volatile I3C2BCRbits_t I3C2BCRbits __at(0x0DB);
// bitfield macros
#define _I3C2BCR_BCR0_POSN                                  0x0
#define _I3C2BCR_BCR0_POSITION                              0x0
#define _I3C2BCR_BCR0_SIZE                                  0x1
#define _I3C2BCR_BCR0_LENGTH                                0x1
#define _I3C2BCR_BCR0_MASK                                  0x1
#define _I3C2BCR_BCR1_POSN                                  0x1
#define _I3C2BCR_BCR1_POSITION                              0x1
#define _I3C2BCR_BCR1_SIZE                                  0x1
#define _I3C2BCR_BCR1_LENGTH                                0x1
#define _I3C2BCR_BCR1_MASK                                  0x2
#define _I3C2BCR_BCR2_POSN                                  0x2
#define _I3C2BCR_BCR2_POSITION                              0x2
#define _I3C2BCR_BCR2_SIZE                                  0x1
#define _I3C2BCR_BCR2_LENGTH                                0x1
#define _I3C2BCR_BCR2_MASK                                  0x4
#define _I3C2BCR_BCR3_POSN                                  0x3
#define _I3C2BCR_BCR3_POSITION                              0x3
#define _I3C2BCR_BCR3_SIZE                                  0x1
#define _I3C2BCR_BCR3_LENGTH                                0x1
#define _I3C2BCR_BCR3_MASK                                  0x8
#define _I3C2BCR_BCR4_POSN                                  0x4
#define _I3C2BCR_BCR4_POSITION                              0x4
#define _I3C2BCR_BCR4_SIZE                                  0x1
#define _I3C2BCR_BCR4_LENGTH                                0x1
#define _I3C2BCR_BCR4_MASK                                  0x10
#define _I3C2BCR_BCR5_POSN                                  0x5
#define _I3C2BCR_BCR5_POSITION                              0x5
#define _I3C2BCR_BCR5_SIZE                                  0x1
#define _I3C2BCR_BCR5_LENGTH                                0x1
#define _I3C2BCR_BCR5_MASK                                  0x20
#define _I3C2BCR_BCR6_POSN                                  0x6
#define _I3C2BCR_BCR6_POSITION                              0x6
#define _I3C2BCR_BCR6_SIZE                                  0x1
#define _I3C2BCR_BCR6_LENGTH                                0x1
#define _I3C2BCR_BCR6_MASK                                  0x40
#define _I3C2BCR_BCR7_POSN                                  0x7
#define _I3C2BCR_BCR7_POSITION                              0x7
#define _I3C2BCR_BCR7_SIZE                                  0x1
#define _I3C2BCR_BCR7_LENGTH                                0x1
#define _I3C2BCR_BCR7_MASK                                  0x80
#define _I3C2BCR_BCR_7_6_POSN                               0x6
#define _I3C2BCR_BCR_7_6_POSITION                           0x6
#define _I3C2BCR_BCR_7_6_SIZE                               0x2
#define _I3C2BCR_BCR_7_6_LENGTH                             0x2
#define _I3C2BCR_BCR_7_6_MASK                               0xC0

// Register: I3C2DCR
#define I3C2DCR I3C2DCR
extern volatile unsigned char           I3C2DCR             __at(0x0DC);
#ifndef _LIB_BUILD
asm("I3C2DCR equ 0DCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCR                    :8;
    };
} I3C2DCRbits_t;
extern volatile I3C2DCRbits_t I3C2DCRbits __at(0x0DC);
// bitfield macros
#define _I3C2DCR_DCR_POSN                                   0x0
#define _I3C2DCR_DCR_POSITION                               0x0
#define _I3C2DCR_DCR_SIZE                                   0x8
#define _I3C2DCR_DCR_LENGTH                                 0x8
#define _I3C2DCR_DCR_MASK                                   0xFF

// Register: I3C2DSTAT0
#define I3C2DSTAT0 I3C2DSTAT0
extern volatile unsigned char           I3C2DSTAT0          __at(0x0DD);
#ifndef _LIB_BUILD
asm("I3C2DSTAT0 equ 0DDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPEND                :4;
        unsigned                        :1;
        unsigned PERR                   :1;
        unsigned ACTMODE                :2;
    };
    struct {
        unsigned INPEND0                :1;
        unsigned INTPEND1               :1;
        unsigned INTPEND2               :1;
        unsigned INTPEND3               :1;
        unsigned                        :2;
        unsigned ACTMODE0               :1;
        unsigned ACTMODE1               :1;
    };
} I3C2DSTAT0bits_t;
extern volatile I3C2DSTAT0bits_t I3C2DSTAT0bits __at(0x0DD);
// bitfield macros
#define _I3C2DSTAT0_INTPEND_POSN                            0x0
#define _I3C2DSTAT0_INTPEND_POSITION                        0x0
#define _I3C2DSTAT0_INTPEND_SIZE                            0x4
#define _I3C2DSTAT0_INTPEND_LENGTH                          0x4
#define _I3C2DSTAT0_INTPEND_MASK                            0xF
#define _I3C2DSTAT0_PERR_POSN                               0x5
#define _I3C2DSTAT0_PERR_POSITION                           0x5
#define _I3C2DSTAT0_PERR_SIZE                               0x1
#define _I3C2DSTAT0_PERR_LENGTH                             0x1
#define _I3C2DSTAT0_PERR_MASK                               0x20
#define _I3C2DSTAT0_ACTMODE_POSN                            0x6
#define _I3C2DSTAT0_ACTMODE_POSITION                        0x6
#define _I3C2DSTAT0_ACTMODE_SIZE                            0x2
#define _I3C2DSTAT0_ACTMODE_LENGTH                          0x2
#define _I3C2DSTAT0_ACTMODE_MASK                            0xC0
#define _I3C2DSTAT0_INPEND0_POSN                            0x0
#define _I3C2DSTAT0_INPEND0_POSITION                        0x0
#define _I3C2DSTAT0_INPEND0_SIZE                            0x1
#define _I3C2DSTAT0_INPEND0_LENGTH                          0x1
#define _I3C2DSTAT0_INPEND0_MASK                            0x1
#define _I3C2DSTAT0_INTPEND1_POSN                           0x1
#define _I3C2DSTAT0_INTPEND1_POSITION                       0x1
#define _I3C2DSTAT0_INTPEND1_SIZE                           0x1
#define _I3C2DSTAT0_INTPEND1_LENGTH                         0x1
#define _I3C2DSTAT0_INTPEND1_MASK                           0x2
#define _I3C2DSTAT0_INTPEND2_POSN                           0x2
#define _I3C2DSTAT0_INTPEND2_POSITION                       0x2
#define _I3C2DSTAT0_INTPEND2_SIZE                           0x1
#define _I3C2DSTAT0_INTPEND2_LENGTH                         0x1
#define _I3C2DSTAT0_INTPEND2_MASK                           0x4
#define _I3C2DSTAT0_INTPEND3_POSN                           0x3
#define _I3C2DSTAT0_INTPEND3_POSITION                       0x3
#define _I3C2DSTAT0_INTPEND3_SIZE                           0x1
#define _I3C2DSTAT0_INTPEND3_LENGTH                         0x1
#define _I3C2DSTAT0_INTPEND3_MASK                           0x8
#define _I3C2DSTAT0_ACTMODE0_POSN                           0x6
#define _I3C2DSTAT0_ACTMODE0_POSITION                       0x6
#define _I3C2DSTAT0_ACTMODE0_SIZE                           0x1
#define _I3C2DSTAT0_ACTMODE0_LENGTH                         0x1
#define _I3C2DSTAT0_ACTMODE0_MASK                           0x40
#define _I3C2DSTAT0_ACTMODE1_POSN                           0x7
#define _I3C2DSTAT0_ACTMODE1_POSITION                       0x7
#define _I3C2DSTAT0_ACTMODE1_SIZE                           0x1
#define _I3C2DSTAT0_ACTMODE1_LENGTH                         0x1
#define _I3C2DSTAT0_ACTMODE1_MASK                           0x80

// Register: I3C2DSTAT1
#define I3C2DSTAT1 I3C2DSTAT1
extern volatile unsigned char           I3C2DSTAT1          __at(0x0DE);
#ifndef _LIB_BUILD
asm("I3C2DSTAT1 equ 0DEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VRSV                   :8;
    };
    struct {
        unsigned VRSV0                  :1;
        unsigned VRSV1                  :1;
        unsigned VRSV2                  :1;
        unsigned VRSV3                  :1;
        unsigned VRSV4                  :1;
        unsigned VRSV5                  :1;
        unsigned VRSV6                  :1;
        unsigned VRSV7                  :1;
    };
} I3C2DSTAT1bits_t;
