garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile I3C2DSTAT1bits_t I3C2DSTAT1bits __at(0x0DE);
// bitfield macros
#define _I3C2DSTAT1_VRSV_POSN                               0x0
#define _I3C2DSTAT1_VRSV_POSITION                           0x0
#define _I3C2DSTAT1_VRSV_SIZE                               0x8
#define _I3C2DSTAT1_VRSV_LENGTH                             0x8
#define _I3C2DSTAT1_VRSV_MASK                               0xFF
#define _I3C2DSTAT1_VRSV0_POSN                              0x0
#define _I3C2DSTAT1_VRSV0_POSITION                          0x0
#define _I3C2DSTAT1_VRSV0_SIZE                              0x1
#define _I3C2DSTAT1_VRSV0_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV0_MASK                              0x1
#define _I3C2DSTAT1_VRSV1_POSN                              0x1
#define _I3C2DSTAT1_VRSV1_POSITION                          0x1
#define _I3C2DSTAT1_VRSV1_SIZE                              0x1
#define _I3C2DSTAT1_VRSV1_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV1_MASK                              0x2
#define _I3C2DSTAT1_VRSV2_POSN                              0x2
#define _I3C2DSTAT1_VRSV2_POSITION                          0x2
#define _I3C2DSTAT1_VRSV2_SIZE                              0x1
#define _I3C2DSTAT1_VRSV2_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV2_MASK                              0x4
#define _I3C2DSTAT1_VRSV3_POSN                              0x3
#define _I3C2DSTAT1_VRSV3_POSITION                          0x3
#define _I3C2DSTAT1_VRSV3_SIZE                              0x1
#define _I3C2DSTAT1_VRSV3_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV3_MASK                              0x8
#define _I3C2DSTAT1_VRSV4_POSN                              0x4
#define _I3C2DSTAT1_VRSV4_POSITION                          0x4
#define _I3C2DSTAT1_VRSV4_SIZE                              0x1
#define _I3C2DSTAT1_VRSV4_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV4_MASK                              0x10
#define _I3C2DSTAT1_VRSV5_POSN                              0x5
#define _I3C2DSTAT1_VRSV5_POSITION                          0x5
#define _I3C2DSTAT1_VRSV5_SIZE                              0x1
#define _I3C2DSTAT1_VRSV5_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV5_MASK                              0x20
#define _I3C2DSTAT1_VRSV6_POSN                              0x6
#define _I3C2DSTAT1_VRSV6_POSITION                          0x6
#define _I3C2DSTAT1_VRSV6_SIZE                              0x1
#define _I3C2DSTAT1_VRSV6_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV6_MASK                              0x40
#define _I3C2DSTAT1_VRSV7_POSN                              0x7
#define _I3C2DSTAT1_VRSV7_POSITION                          0x7
#define _I3C2DSTAT1_VRSV7_SIZE                              0x1
#define _I3C2DSTAT1_VRSV7_LENGTH                            0x1
#define _I3C2DSTAT1_VRSV7_MASK                              0x80

// Register: I3C2MWS
#define I3C2MWS I3C2MWS
extern volatile unsigned char           I3C2MWS             __at(0x0DF);
#ifndef _LIB_BUILD
asm("I3C2MWS equ 0DFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MWS0                   :1;
        unsigned MWS1                   :1;
        unsigned MWS2                   :1;
        unsigned MWS3                   :1;
        unsigned MWS4                   :1;
        unsigned MWS5                   :1;
        unsigned MWS6                   :1;
        unsigned MWS7                   :1;
    };
    struct {
        unsigned MWS_2_0                :3;
        unsigned                        :1;
        unsigned MWS_7_4                :4;
    };
} I3C2MWSbits_t;
extern volatile I3C2MWSbits_t I3C2MWSbits __at(0x0DF);
// bitfield macros
#define _I3C2MWS_MWS0_POSN                                  0x0
#define _I3C2MWS_MWS0_POSITION                              0x0
#define _I3C2MWS_MWS0_SIZE                                  0x1
#define _I3C2MWS_MWS0_LENGTH                                0x1
#define _I3C2MWS_MWS0_MASK                                  0x1
#define _I3C2MWS_MWS1_POSN                                  0x1
#define _I3C2MWS_MWS1_POSITION                              0x1
#define _I3C2MWS_MWS1_SIZE                                  0x1
#define _I3C2MWS_MWS1_LENGTH                                0x1
#define _I3C2MWS_MWS1_MASK                                  0x2
#define _I3C2MWS_MWS2_POSN                                  0x2
#define _I3C2MWS_MWS2_POSITION                              0x2
#define _I3C2MWS_MWS2_SIZE                                  0x1
#define _I3C2MWS_MWS2_LENGTH                                0x1
#define _I3C2MWS_MWS2_MASK                                  0x4
#define _I3C2MWS_MWS3_POSN                                  0x3
#define _I3C2MWS_MWS3_POSITION                              0x3
#define _I3C2MWS_MWS3_SIZE                                  0x1
#define _I3C2MWS_MWS3_LENGTH                                0x1
#define _I3C2MWS_MWS3_MASK                                  0x8
#define _I3C2MWS_MWS4_POSN                                  0x4
#define _I3C2MWS_MWS4_POSITION                              0x4
#define _I3C2MWS_MWS4_SIZE                                  0x1
#define _I3C2MWS_MWS4_LENGTH                                0x1
#define _I3C2MWS_MWS4_MASK                                  0x10
#define _I3C2MWS_MWS5_POSN                                  0x5
#define _I3C2MWS_MWS5_POSITION                              0x5
#define _I3C2MWS_MWS5_SIZE                                  0x1
#define _I3C2MWS_MWS5_LENGTH                                0x1
#define _I3C2MWS_MWS5_MASK                                  0x20
#define _I3C2MWS_MWS6_POSN                                  0x6
#define _I3C2MWS_MWS6_POSITION                              0x6
#define _I3C2MWS_MWS6_SIZE                                  0x1
#define _I3C2MWS_MWS6_LENGTH                                0x1
#define _I3C2MWS_MWS6_MASK                                  0x40
#define _I3C2MWS_MWS7_POSN                                  0x7
#define _I3C2MWS_MWS7_POSITION                              0x7
#define _I3C2MWS_MWS7_SIZE                                  0x1
#define _I3C2MWS_MWS7_LENGTH                                0x1
#define _I3C2MWS_MWS7_MASK                                  0x80
#define _I3C2MWS_MWS_2_0_POSN                               0x0
#define _I3C2MWS_MWS_2_0_POSITION                           0x0
#define _I3C2MWS_MWS_2_0_SIZE                               0x3
#define _I3C2MWS_MWS_2_0_LENGTH                             0x3
#define _I3C2MWS_MWS_2_0_MASK                               0x7
#define _I3C2MWS_MWS_7_4_POSN                               0x4
#define _I3C2MWS_MWS_7_4_POSITION                           0x4
#define _I3C2MWS_MWS_7_4_SIZE                               0x4
#define _I3C2MWS_MWS_7_4_LENGTH                             0x4
#define _I3C2MWS_MWS_7_4_MASK                               0xF0

// Register: I3C2MRS
#define I3C2MRS I3C2MRS
extern volatile unsigned char           I3C2MRS             __at(0x0E0);
#ifndef _LIB_BUILD
asm("I3C2MRS equ 0E0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRS0                   :1;
        unsigned MRS1                   :1;
        unsigned MRS2                   :1;
        unsigned MRS3                   :1;
        unsigned MRS4                   :1;
        unsigned MRS5                   :1;
        unsigned MRS6                   :1;
        unsigned MRS7                   :1;
    };
    struct {
        unsigned MRS_2_0                :3;
        unsigned MRS_5_3                :3;
    };
} I3C2MRSbits_t;
