garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
// Register: I3C2BUSCXT
#define I3C2BUSCXT I3C2BUSCXT
extern volatile unsigned char           I3C2BUSCXT          __at(0x0E5);
#ifndef _LIB_BUILD
asm("I3C2BUSCXT equ 0E5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUSCXT                 :8;
    };
} I3C2BUSCXTbits_t;
extern volatile I3C2BUSCXTbits_t I3C2BUSCXTbits __at(0x0E5);
// bitfield macros
#define _I3C2BUSCXT_BUSCXT_POSN                             0x0
#define _I3C2BUSCXT_BUSCXT_POSITION                         0x0
#define _I3C2BUSCXT_BUSCXT_SIZE                             0x8
#define _I3C2BUSCXT_BUSCXT_LENGTH                           0x8
#define _I3C2BUSCXT_BUSCXT_MASK                             0xFF

// Register: I3C2CCC
#define I3C2CCC I3C2CCC
extern volatile unsigned char           I3C2CCC             __at(0x0E6);
#ifndef _LIB_BUILD
asm("I3C2CCC equ 0E6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCC                    :8;
    };
} I3C2CCCbits_t;
extern volatile I3C2CCCbits_t I3C2CCCbits __at(0x0E6);
// bitfield macros
#define _I3C2CCC_CCC_POSN                                   0x0
#define _I3C2CCC_CCC_POSITION                               0x0
#define _I3C2CCC_CCC_SIZE                                   0x8
#define _I3C2CCC_CCC_LENGTH                                 0x8
#define _I3C2CCC_CCC_MASK                                   0xFF

// Register: I3C2I2CCON
#define I3C2I2CCON I3C2I2CCON
extern volatile unsigned char           I3C2I2CCON          __at(0x0E7);
#ifndef _LIB_BUILD
asm("I3C2I2CCON equ 0E7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SDAHT                  :2;
        unsigned FLTEN                  :1;
    };
} I3C2I2CCONbits_t;
extern volatile I3C2I2CCONbits_t I3C2I2CCONbits __at(0x0E7);
// bitfield macros
#define _I3C2I2CCON_SDAHT_POSN                              0x0
#define _I3C2I2CCON_SDAHT_POSITION                          0x0
#define _I3C2I2CCON_SDAHT_SIZE                              0x2
#define _I3C2I2CCON_SDAHT_LENGTH                            0x2
#define _I3C2I2CCON_SDAHT_MASK                              0x3
#define _I3C2I2CCON_FLTEN_POSN                              0x2
#define _I3C2I2CCON_FLTEN_POSITION                          0x2
#define _I3C2I2CCON_FLTEN_SIZE                              0x1
#define _I3C2I2CCON_FLTEN_LENGTH                            0x1
#define _I3C2I2CCON_FLTEN_MASK                              0x4

// Register: I3C2CLK
#define I3C2CLK I3C2CLK
extern volatile unsigned char           I3C2CLK             __at(0x0E8);
#ifndef _LIB_BUILD
asm("I3C2CLK equ 0E8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} I3C2CLKbits_t;
extern volatile I3C2CLKbits_t I3C2CLKbits __at(0x0E8);
// bitfield macros
#define _I3C2CLK_CLK_POSN                                   0x0
#define _I3C2CLK_CLK_POSITION                               0x0
#define _I3C2CLK_CLK_SIZE                                   0x8
#define _I3C2CLK_CLK_LENGTH                                 0x8
#define _I3C2CLK_CLK_MASK                                   0xFF
#define _I3C2CLK_CLK0_POSN                                  0x0
#define _I3C2CLK_CLK0_POSITION                              0x0
#define _I3C2CLK_CLK0_SIZE                                  0x1
#define _I3C2CLK_CLK0_LENGTH                                0x1
#define _I3C2CLK_CLK0_MASK                                  0x1
#define _I3C2CLK_CLK1_POSN                                  0x1
#define _I3C2CLK_CLK1_POSITION                              0x1
#define _I3C2CLK_CLK1_SIZE                                  0x1
#define _I3C2CLK_CLK1_LENGTH                                0x1
#define _I3C2CLK_CLK1_MASK                                  0x2
#define _I3C2CLK_CLK2_POSN                                  0x2
#define _I3C2CLK_CLK2_POSITION                              0x2
#define _I3C2CLK_CLK2_SIZE                                  0x1
#define _I3C2CLK_CLK2_LENGTH                                0x1
#define _I3C2CLK_CLK2_MASK                                  0x4
#define _I3C2CLK_CLK3_POSN                                  0x3
#define _I3C2CLK_CLK3_POSITION                              0x3
#define _I3C2CLK_CLK3_SIZE                                  0x1
#define _I3C2CLK_CLK3_LENGTH                                0x1
#define _I3C2CLK_CLK3_MASK                                  0x8

// Register: CLKRCON
#define CLKRCON CLKRCON
extern volatile unsigned char           CLKRCON             __at(0x100);
#ifndef _LIB_BUILD
asm("CLKRCON equ 0100h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DIV                    :3;
        unsigned DC                     :2;
        unsigned                        :2;
        unsigned EN                     :1;
    };
    struct {
        unsigned CLKRDIV0               :1;
        unsigned CLKRDIV1               :1;
        unsigned CLKRDIV2               :1;
        unsigned CLKRDC0                :1;
        unsigned CLKRDC1                :1;
        unsigned                        :2;
        unsigned CLKREN                 :1;
    };
    struct {
        unsigned DIV0                   :1;
        unsigned DIV1                   :1;
        unsigned DIV2                   :1;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
} CLKRCONbits_t;
extern volatile CLKRCONbits_t CLKRCONbits __at(0x100);
// bitfield macros
#define _CLKRCON_DIV_POSN                                   0x0
#define _CLKRCON_DIV_POSITION                               0x0
#define _CLKRCON_DIV_SIZE                                   0x3
#define _CLKRCON_DIV_LENGTH                                 0x3
#define _CLKRCON_DIV_MASK                                   0x7
#define _CLKRCON_DC_POSN                                    0x3
#define _CLKRCON_DC_POSITION                                0x3
#define _CLKRCON_DC_SIZE                                    0x2
#define _CLKRCON_DC_LENGTH                                  0x2
#define _CLKRCON_DC_MASK                                    0x18
#define _CLKRCON_EN_POSN                                    0x7
#define _CLKRCON_EN_POSITION                                0x7
#define _CLKRCON_EN_SIZE                                    0x1
#define _CLKRCON_EN_LENGTH                                  0x1
#define _CLKRCON_EN_MASK                                    0x80
#define _CLKRCON_CLKRDIV0_POSN                              0x0
#define _CLKRCON_CLKRDIV0_POSITION                          0x0
#define _CLKRCON_CLKRDIV0_SIZE                              0x1
#define _CLKRCON_CLKRDIV0_LENGTH                            0x1
#define _CLKRCON_CLKRDIV0_MASK                              0x1
#define _CLKRCON_CLKRDIV1_POSN                              0x1
#define _CLKRCON_CLKRDIV1_POSITION                          0x1
#define _CLKRCON_CLKRDIV1_SIZE                              0x1
#define _CLKRCON_CLKRDIV1_LENGTH                            0x1
#define _CLKRCON_CLKRDIV1_MASK                              0x2
#define _CLKRCON_CLKRDIV2_POSN                              0x2
#define _CLKRCON_CLKRDIV2_POSITION                          0x2
#define _CLKRCON_CLKRDIV2_SIZE                              0x1
#define _CLKRCON_CLKRDIV2_LENGTH                            0x1
#define _CLKRCON_CLKRDIV2_MASK                              0x4
#define _CLKRCON_CLKRDC0_POSN                               0x3
#define _CLKRCON_CLKRDC0_POSITION                           0x3
#define _CLKRCON_CLKRDC0_SIZE                               0x1
#define _CLKRCON_CLKRDC0_LENGTH                             0x1
#define _CLKRCON_CLKRDC0_MASK                               0x8
#define _CLKRCON_CLKRDC1_POSN                               0x4
#define _CLKRCON_CLKRDC1_POSITION                           0x4
#define _CLKRCON_CLKRDC1_SIZE                               0x1
#define _CLKRCON_CLKRDC1_LENGTH                             0x1
#define _CLKRCON_CLKRDC1_MASK                               0x10
#define _CLKRCON_CLKREN_POSN                                0x7
#define _CLKRCON_CLKREN_POSITION                            0x7
#define _CLKRCON_CLKREN_SIZE                                0x1
#define _CLKRCON_CLKREN_LENGTH                              0x1
#define _CLKRCON_CLKREN_MASK                                0x80
#define _CLKRCON_DIV0_POSN                                  0x0
#define _CLKRCON_DIV0_POSITION                              0x0
#define _CLKRCON_DIV0_SIZE                                  0x1
#define _CLKRCON_DIV0_LENGTH                                0x1
#define _CLKRCON_DIV0_MASK                                  0x1
#define _CLKRCON_DIV1_POSN                                  0x1
#define _CLKRCON_DIV1_POSITION                              0x1
#define _CLKRCON_DIV1_SIZE                                  0x1
#define _CLKRCON_DIV1_LENGTH                                0x1
#define _CLKRCON_DIV1_MASK                                  0x2
#define _CLKRCON_DIV2_POSN                                  0x2
#define _CLKRCON_DIV2_POSITION                              0x2
#define _CLKRCON_DIV2_SIZE                                  0x1
#define _CLKRCON_DIV2_LENGTH                                0x1
#define _CLKRCON_DIV2_MASK                                  0x4
#define _CLKRCON_DC0_POSN                                   0x3
#define _CLKRCON_DC0_POSITION                               0x3
#define _CLKRCON_DC0_SIZE                                   0x1
#define _CLKRCON_DC0_LENGTH                                 0x1
#define _CLKRCON_DC0_MASK                                   0x8
#define _CLKRCON_DC1_POSN                                   0x4
#define _CLKRCON_DC1_POSITION                               0x4
#define _CLKRCON_DC1_SIZE                                   0x1
#define _CLKRCON_DC1_LENGTH                                 0x1
#define _CLKRCON_DC1_MASK                                   0x10

