garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile TU16BCRHbits_t TU16BCRHbits __at(0x13F);
// bitfield macros
#define _TU16BCRH_CRH_POSN                                  0x0
#define _TU16BCRH_CRH_POSITION                              0x0
#define _TU16BCRH_CRH_SIZE                                  0x8
#define _TU16BCRH_CRH_LENGTH                                0x8
#define _TU16BCRH_CRH_MASK                                  0xFF
#define _TU16BCRH_CRH0_POSN                                 0x0
#define _TU16BCRH_CRH0_POSITION                             0x0
#define _TU16BCRH_CRH0_SIZE                                 0x1
#define _TU16BCRH_CRH0_LENGTH                               0x1
#define _TU16BCRH_CRH0_MASK                                 0x1
#define _TU16BCRH_CRH1_POSN                                 0x1
#define _TU16BCRH_CRH1_POSITION                             0x1
#define _TU16BCRH_CRH1_SIZE                                 0x1
#define _TU16BCRH_CRH1_LENGTH                               0x1
#define _TU16BCRH_CRH1_MASK                                 0x2
#define _TU16BCRH_CRH2_POSN                                 0x2
#define _TU16BCRH_CRH2_POSITION                             0x2
#define _TU16BCRH_CRH2_SIZE                                 0x1
#define _TU16BCRH_CRH2_LENGTH                               0x1
#define _TU16BCRH_CRH2_MASK                                 0x4
#define _TU16BCRH_CRH3_POSN                                 0x3
#define _TU16BCRH_CRH3_POSITION                             0x3
#define _TU16BCRH_CRH3_SIZE                                 0x1
#define _TU16BCRH_CRH3_LENGTH                               0x1
#define _TU16BCRH_CRH3_MASK                                 0x8
#define _TU16BCRH_CRH4_POSN                                 0x4
#define _TU16BCRH_CRH4_POSITION                             0x4
#define _TU16BCRH_CRH4_SIZE                                 0x1
#define _TU16BCRH_CRH4_LENGTH                               0x1
#define _TU16BCRH_CRH4_MASK                                 0x10
#define _TU16BCRH_CRH5_POSN                                 0x5
#define _TU16BCRH_CRH5_POSITION                             0x5
#define _TU16BCRH_CRH5_SIZE                                 0x1
#define _TU16BCRH_CRH5_LENGTH                               0x1
#define _TU16BCRH_CRH5_MASK                                 0x20
#define _TU16BCRH_CRH6_POSN                                 0x6
#define _TU16BCRH_CRH6_POSITION                             0x6
#define _TU16BCRH_CRH6_SIZE                                 0x1
#define _TU16BCRH_CRH6_LENGTH                               0x1
#define _TU16BCRH_CRH6_MASK                                 0x40
#define _TU16BCRH_CRH7_POSN                                 0x7
#define _TU16BCRH_CRH7_POSITION                             0x7
#define _TU16BCRH_CRH7_SIZE                                 0x1
#define _TU16BCRH_CRH7_LENGTH                               0x1
#define _TU16BCRH_CRH7_MASK                                 0x80
#define _TU16BCRH_TU16BCRH0_POSN                            0x0
#define _TU16BCRH_TU16BCRH0_POSITION                        0x0
#define _TU16BCRH_TU16BCRH0_SIZE                            0x1
#define _TU16BCRH_TU16BCRH0_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH0_MASK                            0x1
#define _TU16BCRH_TU16BCRH1_POSN                            0x1
#define _TU16BCRH_TU16BCRH1_POSITION                        0x1
#define _TU16BCRH_TU16BCRH1_SIZE                            0x1
#define _TU16BCRH_TU16BCRH1_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH1_MASK                            0x2
#define _TU16BCRH_TU16BCRH2_POSN                            0x2
#define _TU16BCRH_TU16BCRH2_POSITION                        0x2
#define _TU16BCRH_TU16BCRH2_SIZE                            0x1
#define _TU16BCRH_TU16BCRH2_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH2_MASK                            0x4
#define _TU16BCRH_TU16BCRH3_POSN                            0x3
#define _TU16BCRH_TU16BCRH3_POSITION                        0x3
#define _TU16BCRH_TU16BCRH3_SIZE                            0x1
#define _TU16BCRH_TU16BCRH3_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH3_MASK                            0x8
#define _TU16BCRH_TU16BCRH4_POSN                            0x4
#define _TU16BCRH_TU16BCRH4_POSITION                        0x4
#define _TU16BCRH_TU16BCRH4_SIZE                            0x1
#define _TU16BCRH_TU16BCRH4_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH4_MASK                            0x10
#define _TU16BCRH_TU16BCRH5_POSN                            0x5
#define _TU16BCRH_TU16BCRH5_POSITION                        0x5
#define _TU16BCRH_TU16BCRH5_SIZE                            0x1
#define _TU16BCRH_TU16BCRH5_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH5_MASK                            0x20
#define _TU16BCRH_TU16BCRH6_POSN                            0x6
#define _TU16BCRH_TU16BCRH6_POSITION                        0x6
#define _TU16BCRH_TU16BCRH6_SIZE                            0x1
#define _TU16BCRH_TU16BCRH6_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH6_MASK                            0x40
#define _TU16BCRH_TU16BCRH7_POSN                            0x7
#define _TU16BCRH_TU16BCRH7_POSITION                        0x7
#define _TU16BCRH_TU16BCRH7_SIZE                            0x1
#define _TU16BCRH_TU16BCRH7_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH7_MASK                            0x80
#define _TU16BCRH_TU16BCR8_POSN                             0x0
#define _TU16BCRH_TU16BCR8_POSITION                         0x0
#define _TU16BCRH_TU16BCR8_SIZE                             0x1
#define _TU16BCRH_TU16BCR8_LENGTH                           0x1
#define _TU16BCRH_TU16BCR8_MASK                             0x1
#define _TU16BCRH_TU16BCR9_POSN                             0x1
#define _TU16BCRH_TU16BCR9_POSITION                         0x1
#define _TU16BCRH_TU16BCR9_SIZE                             0x1
#define _TU16BCRH_TU16BCR9_LENGTH                           0x1
#define _TU16BCRH_TU16BCR9_MASK                             0x2
#define _TU16BCRH_TU16BCR10_POSN                            0x2
#define _TU16BCRH_TU16BCR10_POSITION                        0x2
#define _TU16BCRH_TU16BCR10_SIZE                            0x1
#define _TU16BCRH_TU16BCR10_LENGTH                          0x1
#define _TU16BCRH_TU16BCR10_MASK                            0x4
#define _TU16BCRH_TU16BCR11_POSN                            0x3
#define _TU16BCRH_TU16BCR11_POSITION                        0x3
#define _TU16BCRH_TU16BCR11_SIZE                            0x1
#define _TU16BCRH_TU16BCR11_LENGTH                          0x1
#define _TU16BCRH_TU16BCR11_MASK                            0x8
#define _TU16BCRH_TU16BCR12_POSN                            0x4
#define _TU16BCRH_TU16BCR12_POSITION                        0x4
#define _TU16BCRH_TU16BCR12_SIZE                            0x1
#define _TU16BCRH_TU16BCR12_LENGTH                          0x1
#define _TU16BCRH_TU16BCR12_MASK                            0x10
#define _TU16BCRH_TU16BCR13_POSN                            0x5
#define _TU16BCRH_TU16BCR13_POSITION                        0x5
#define _TU16BCRH_TU16BCR13_SIZE                            0x1
#define _TU16BCRH_TU16BCR13_LENGTH                          0x1
#define _TU16BCRH_TU16BCR13_MASK                            0x20
#define _TU16BCRH_TU16BCR14_POSN                            0x6
#define _TU16BCRH_TU16BCR14_POSITION                        0x6
#define _TU16BCRH_TU16BCR14_SIZE                            0x1
#define _TU16BCRH_TU16BCR14_LENGTH                          0x1
#define _TU16BCRH_TU16BCR14_MASK                            0x40
#define _TU16BCRH_TU16BCR15_POSN                            0x7
#define _TU16BCRH_TU16BCR15_POSITION                        0x7
#define _TU16BCRH_TU16BCR15_SIZE                            0x1
#define _TU16BCRH_TU16BCR15_LENGTH                          0x1
#define _TU16BCRH_TU16BCR15_MASK                            0x80

// Register: TU16BTMRT
#define TU16BTMRT TU16BTMRT
extern volatile unsigned char           TU16BTMRT           __at(0x141);
#ifndef _LIB_BUILD
asm("TU16BTMRT equ 0141h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRT                   :8;
    };
    struct {
        unsigned TMRT0                  :1;
        unsigned TMRT1                  :1;
        unsigned TMRT2                  :1;
        unsigned TMRT3                  :1;
        unsigned TMRT4                  :1;
        unsigned TMRT5                  :1;
        unsigned TMRT6                  :1;
        unsigned TMRT7                  :1;
    };
    struct {
        unsigned TU16BTMRT0             :1;
        unsigned TU16BTMRT1             :1;
        unsigned TU16BTMRT2             :1;
        unsigned TU16BTMRT3             :1;
        unsigned TU16BTMRT4             :1;
        unsigned TU16BTMRT5             :1;
        unsigned TU16BTMRT6             :1;
        unsigned TU16BTMRT7             :1;
    };
    struct {
        unsigned TU16BTMR24             :1;
        unsigned TU16BTMR25             :1;
        unsigned TU16BTMR26             :1;
        unsigned TU16BTMR27             :1;
        unsigned TU16BTMR28             :1;
        unsigned TU16BTMR29             :1;
        unsigned TU16BTMR30             :1;
        unsigned TU16BTMR31             :1;
    };
} TU16BTMRTbits_t;
extern volatile TU16BTMRTbits_t TU16BTMRTbits __at(0x141);
// bitfield macros
#define _TU16BTMRT_TMRT_POSN                                0x0
#define _TU16BTMRT_TMRT_POSITION                            0x0
#define _TU16BTMRT_TMRT_SIZE                                0x8
#define _TU16BTMRT_TMRT_LENGTH                              0x8
#define _TU16BTMRT_TMRT_MASK                                0xFF
#define _TU16BTMRT_TMRT0_POSN                               0x0
#define _TU16BTMRT_TMRT0_POSITION                           0x0
#define _TU16BTMRT_TMRT0_SIZE                               0x1
#define _TU16BTMRT_TMRT0_LENGTH                             0x1
#define _TU16BTMRT_TMRT0_MASK                               0x1
#define _TU16BTMRT_TMRT1_POSN                               0x1
#define _TU16BTMRT_TMRT1_POSITION                           0x1
#define _TU16BTMRT_TMRT1_SIZE                               0x1
#define _TU16BTMRT_TMRT1_LENGTH                             0x1
#define _TU16BTMRT_TMRT1_MASK                               0x2
#define _TU16BTMRT_TMRT2_POSN                               0x2
#define _TU16BTMRT_TMRT2_POSITION                           0x2
#define _TU16BTMRT_TMRT2_SIZE                               0x1
#define _TU16BTMRT_TMRT2_LENGTH                             0x1
#define _TU16BTMRT_TMRT2_MASK                               0x4
#define _TU16BTMRT_TMRT3_POSN                               0x3
#define _TU16BTMRT_TMRT3_POSITION                           0x3
#define _TU16BTMRT_TMRT3_SIZE                               0x1
#define _TU16BTMRT_TMRT3_LENGTH                             0x1
#define _TU16BTMRT_TMRT3_MASK                               0x8
#define _TU16BTMRT_TMRT4_POSN                               0x4
#define _TU16BTMRT_TMRT4_POSITION                           0x4
#define _TU16BTMRT_TMRT4_SIZE                               0x1
#define _TU16BTMRT_TMRT4_LENGTH                             0x1
#define _TU16BTMRT_TMRT4_MASK                               0x10
#define _TU16BTMRT_TMRT5_POSN                               0x5
#define _TU16BTMRT_TMRT5_POSITION                           0x5
#define _TU16BTMRT_TMRT5_SIZE                               0x1
#define _TU16BTMRT_TMRT5_LENGTH                             0x1
#define _TU16BTMRT_TMRT5_MASK                               0x20
#define _TU16BTMRT_TMRT6_POSN                               0x6
#define _TU16BTMRT_TMRT6_POSITION                           0x6
#define _TU16BTMRT_TMRT6_SIZE                               0x1
#define _TU16BTMRT_TMRT6_LENGTH                             0x1
#define _TU16BTMRT_TMRT6_MASK                               0x40
#define _TU16BTMRT_TMRT7_POSN                               0x7
#define _TU16BTMRT_TMRT7_POSITION                           0x7
#define _TU16BTMRT_TMRT7_SIZE                               0x1
#define _TU16BTMRT_TMRT7_LENGTH                             0x1
#define _TU16BTMRT_TMRT7_MASK                               0x80
#define _TU16BTMRT_TU16BTMRT0_POSN                          0x0
#define _TU16BTMRT_TU16BTMRT0_POSITION                      0x0
#define _TU16BTMRT_TU16BTMRT0_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT0_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT0_MASK                          0x1
#define _TU16BTMRT_TU16BTMRT1_POSN                          0x1
#define _TU16BTMRT_TU16BTMRT1_POSITION                      0x1
#define _TU16BTMRT_TU16BTMRT1_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT1_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT1_MASK                          0x2
#define _TU16BTMRT_TU16BTMRT2_POSN                          0x2
#define _TU16BTMRT_TU16BTMRT2_POSITION                      0x2
#define _TU16BTMRT_TU16BTMRT2_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT2_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT2_MASK                          0x4
#define _TU16BTMRT_TU16BTMRT3_POSN                          0x3
#define _TU16BTMRT_TU16BTMRT3_POSITION                      0x3
#define _TU16BTMRT_TU16BTMRT3_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT3_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT3_MASK                          0x8
#define _TU16BTMRT_TU16BTMRT4_POSN                          0x4
#define _TU16BTMRT_TU16BTMRT4_POSITION                      0x4
#define _TU16BTMRT_TU16BTMRT4_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT4_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT4_MASK                          0x10
#define _TU16BTMRT_TU16BTMRT5_POSN                          0x5
#define _TU16BTMRT_TU16BTMRT5_POSITION                      0x5
#define _TU16BTMRT_TU16BTMRT5_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT5_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT5_MASK                          0x20
#define _TU16BTMRT_TU16BTMRT6_POSN                          0x6
#define _TU16BTMRT_TU16BTMRT6_POSITION                      0x6
#define _TU16BTMRT_TU16BTMRT6_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT6_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT6_MASK                          0x40
#define _TU16BTMRT_TU16BTMRT7_POSN                          0x7
#define _TU16BTMRT_TU16BTMRT7_POSITION                      0x7
#define _TU16BTMRT_TU16BTMRT7_SIZE                          0x1
#define _TU16BTMRT_TU16BTMRT7_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMRT7_MASK                          0x80
#define _TU16BTMRT_TU16BTMR24_POSN                          0x0
#define _TU16BTMRT_TU16BTMR24_POSITION                      0x0
#define _TU16BTMRT_TU16BTMR24_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR24_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR24_MASK                          0x1
#define _TU16BTMRT_TU16BTMR25_POSN                          0x1
#define _TU16BTMRT_TU16BTMR25_POSITION                      0x1
#define _TU16BTMRT_TU16BTMR25_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR25_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR25_MASK                          0x2
#define _TU16BTMRT_TU16BTMR26_POSN                          0x2
#define _TU16BTMRT_TU16BTMR26_POSITION                      0x2
#define _TU16BTMRT_TU16BTMR26_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR26_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR26_MASK                          0x4
#define _TU16BTMRT_TU16BTMR27_POSN                          0x3
#define _TU16BTMRT_TU16BTMR27_POSITION                      0x3
#define _TU16BTMRT_TU16BTMR27_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR27_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR27_MASK                          0x8
#define _TU16BTMRT_TU16BTMR28_POSN                          0x4
#define _TU16BTMRT_TU16BTMR28_POSITION                      0x4
#define _TU16BTMRT_TU16BTMR28_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR28_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR28_MASK                          0x10
#define _TU16BTMRT_TU16BTMR29_POSN                          0x5
#define _TU16BTMRT_TU16BTMR29_POSITION                      0x5
#define _TU16BTMRT_TU16BTMR29_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR29_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR29_MASK                          0x20
#define _TU16BTMRT_TU16BTMR30_POSN                          0x6
#define _TU16BTMRT_TU16BTMR30_POSITION                      0x6
#define _TU16BTMRT_TU16BTMR30_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR30_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR30_MASK                          0x40
#define _TU16BTMRT_TU16BTMR31_POSN                          0x7
#define _TU16BTMRT_TU16BTMR31_POSITION                      0x7
#define _TU16BTMRT_TU16BTMR31_SIZE                          0x1
#define _TU16BTMRT_TU16BTMR31_LENGTH                        0x1
#define _TU16BTMRT_TU16BTMR31_MASK                          0x80

// Register: TU16BCRT
#define TU16BCRT TU16BCRT
extern volatile unsigned char           TU16BCRT            __at(0x141);
#ifndef _LIB_BUILD
asm("TU16BCRT equ 0141h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRT                    :8;
    };
    struct {
        unsigned CRT0                   :1;
        unsigned CRT1                   :1;
        unsigned CRT2                   :1;
        unsigned CRT3                   :1;
        unsigned CRT4                   :1;
        unsigned CRT5                   :1;
        unsigned CRT6                   :1;
        unsigned CRT7                   :1;
    };
    struct {
        unsigned TU16BCRT0              :1;
        unsigned TU16BCRT1              :1;
        unsigned TU16BCRT2              :1;
        unsigned TU16BCRT3              :1;
        unsigned TU16BCRT4              :1;
        unsigned TU16BCRT5              :1;
        unsigned TU16BCRT6              :1;
        unsigned TU16BCRT7              :1;
    };
    struct {
        unsigned TU16BCR24              :1;
        unsigned TU16BCR25              :1;
        unsigned TU16BCR26              :1;
        unsigned TU16BCR27              :1;
        unsigned TU16BCR28              :1;
        unsigned TU16BCR29              :1;
        unsigned TU16BCR30              :1;
        unsigned TU16BCR31              :1;
    };
} TU16BCRTbits_t;
