garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile SPI1BAUDbits_t SPI1BAUDbits __at(0x1E0);
// bitfield macros
#define _SPI1BAUD_BAUD_POSN                                 0x0
#define _SPI1BAUD_BAUD_POSITION                             0x0
#define _SPI1BAUD_BAUD_SIZE                                 0x8
#define _SPI1BAUD_BAUD_LENGTH                               0x8
#define _SPI1BAUD_BAUD_MASK                                 0xFF
#define _SPI1BAUD_BAUD0_POSN                                0x0
#define _SPI1BAUD_BAUD0_POSITION                            0x0
#define _SPI1BAUD_BAUD0_SIZE                                0x1
#define _SPI1BAUD_BAUD0_LENGTH                              0x1
#define _SPI1BAUD_BAUD0_MASK                                0x1
#define _SPI1BAUD_BAUD1_POSN                                0x1
#define _SPI1BAUD_BAUD1_POSITION                            0x1
#define _SPI1BAUD_BAUD1_SIZE                                0x1
#define _SPI1BAUD_BAUD1_LENGTH                              0x1
#define _SPI1BAUD_BAUD1_MASK                                0x2
#define _SPI1BAUD_BAUD2_POSN                                0x2
#define _SPI1BAUD_BAUD2_POSITION                            0x2
#define _SPI1BAUD_BAUD2_SIZE                                0x1
#define _SPI1BAUD_BAUD2_LENGTH                              0x1
#define _SPI1BAUD_BAUD2_MASK                                0x4
#define _SPI1BAUD_BAUD3_POSN                                0x3
#define _SPI1BAUD_BAUD3_POSITION                            0x3
#define _SPI1BAUD_BAUD3_SIZE                                0x1
#define _SPI1BAUD_BAUD3_LENGTH                              0x1
#define _SPI1BAUD_BAUD3_MASK                                0x8
#define _SPI1BAUD_BAUD4_POSN                                0x4
#define _SPI1BAUD_BAUD4_POSITION                            0x4
#define _SPI1BAUD_BAUD4_SIZE                                0x1
#define _SPI1BAUD_BAUD4_LENGTH                              0x1
#define _SPI1BAUD_BAUD4_MASK                                0x10
#define _SPI1BAUD_BAUD5_POSN                                0x5
#define _SPI1BAUD_BAUD5_POSITION                            0x5
#define _SPI1BAUD_BAUD5_SIZE                                0x1
#define _SPI1BAUD_BAUD5_LENGTH                              0x1
#define _SPI1BAUD_BAUD5_MASK                                0x20
#define _SPI1BAUD_BAUD6_POSN                                0x6
#define _SPI1BAUD_BAUD6_POSITION                            0x6
#define _SPI1BAUD_BAUD6_SIZE                                0x1
#define _SPI1BAUD_BAUD6_LENGTH                              0x1
#define _SPI1BAUD_BAUD6_MASK                                0x40
#define _SPI1BAUD_BAUD7_POSN                                0x7
#define _SPI1BAUD_BAUD7_POSITION                            0x7
#define _SPI1BAUD_BAUD7_SIZE                                0x1
#define _SPI1BAUD_BAUD7_LENGTH                              0x1
#define _SPI1BAUD_BAUD7_MASK                                0x80

// Register: SPI1INTF
#define SPI1INTF SPI1INTF
extern volatile unsigned char           SPI1INTF            __at(0x1E1);
#ifndef _LIB_BUILD
asm("SPI1INTF equ 01E1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIF                  :1;
        unsigned RXOIF                  :1;
        unsigned                        :1;
        unsigned EOSIF                  :1;
        unsigned SOSIF                  :1;
        unsigned TCZIF                  :1;
        unsigned SRMTIF                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIF              :1;
        unsigned SPI1RXOIF              :1;
        unsigned                        :1;
        unsigned SPI1EOSIF              :1;
        unsigned SPI1SOSIF              :1;
        unsigned SPI1TCZIF              :1;
        unsigned SPI1SRMTIF             :1;
    };
} SPI1INTFbits_t;
extern volatile SPI1INTFbits_t SPI1INTFbits __at(0x1E1);
// bitfield macros
#define _SPI1INTF_TXUIF_POSN                                0x1
#define _SPI1INTF_TXUIF_POSITION                            0x1
#define _SPI1INTF_TXUIF_SIZE                                0x1
#define _SPI1INTF_TXUIF_LENGTH                              0x1
#define _SPI1INTF_TXUIF_MASK                                0x2
#define _SPI1INTF_RXOIF_POSN                                0x2
#define _SPI1INTF_RXOIF_POSITION                            0x2
#define _SPI1INTF_RXOIF_SIZE                                0x1
#define _SPI1INTF_RXOIF_LENGTH                              0x1
#define _SPI1INTF_RXOIF_MASK                                0x4
#define _SPI1INTF_EOSIF_POSN                                0x4
#define _SPI1INTF_EOSIF_POSITION                            0x4
#define _SPI1INTF_EOSIF_SIZE                                0x1
#define _SPI1INTF_EOSIF_LENGTH                              0x1
#define _SPI1INTF_EOSIF_MASK                                0x10
#define _SPI1INTF_SOSIF_POSN                                0x5
#define _SPI1INTF_SOSIF_POSITION                            0x5
#define _SPI1INTF_SOSIF_SIZE                                0x1
#define _SPI1INTF_SOSIF_LENGTH                              0x1
#define _SPI1INTF_SOSIF_MASK                                0x20
#define _SPI1INTF_TCZIF_POSN                                0x6
#define _SPI1INTF_TCZIF_POSITION                            0x6
#define _SPI1INTF_TCZIF_SIZE                                0x1
#define _SPI1INTF_TCZIF_LENGTH                              0x1
#define _SPI1INTF_TCZIF_MASK                                0x40
#define _SPI1INTF_SRMTIF_POSN                               0x7
#define _SPI1INTF_SRMTIF_POSITION                           0x7
#define _SPI1INTF_SRMTIF_SIZE                               0x1
#define _SPI1INTF_SRMTIF_LENGTH                             0x1
#define _SPI1INTF_SRMTIF_MASK                               0x80
#define _SPI1INTF_SPI1TXUIF_POSN                            0x1
#define _SPI1INTF_SPI1TXUIF_POSITION                        0x1
#define _SPI1INTF_SPI1TXUIF_SIZE                            0x1
#define _SPI1INTF_SPI1TXUIF_LENGTH                          0x1
#define _SPI1INTF_SPI1TXUIF_MASK                            0x2
#define _SPI1INTF_SPI1RXOIF_POSN                            0x2
#define _SPI1INTF_SPI1RXOIF_POSITION                        0x2
#define _SPI1INTF_SPI1RXOIF_SIZE                            0x1
#define _SPI1INTF_SPI1RXOIF_LENGTH                          0x1
#define _SPI1INTF_SPI1RXOIF_MASK                            0x4
#define _SPI1INTF_SPI1EOSIF_POSN                            0x4
#define _SPI1INTF_SPI1EOSIF_POSITION                        0x4
#define _SPI1INTF_SPI1EOSIF_SIZE                            0x1
#define _SPI1INTF_SPI1EOSIF_LENGTH                          0x1
#define _SPI1INTF_SPI1EOSIF_MASK                            0x10
#define _SPI1INTF_SPI1SOSIF_POSN                            0x5
#define _SPI1INTF_SPI1SOSIF_POSITION                        0x5
#define _SPI1INTF_SPI1SOSIF_SIZE                            0x1
#define _SPI1INTF_SPI1SOSIF_LENGTH                          0x1
#define _SPI1INTF_SPI1SOSIF_MASK                            0x20
#define _SPI1INTF_SPI1TCZIF_POSN                            0x6
#define _SPI1INTF_SPI1TCZIF_POSITION                        0x6
#define _SPI1INTF_SPI1TCZIF_SIZE                            0x1
#define _SPI1INTF_SPI1TCZIF_LENGTH                          0x1
#define _SPI1INTF_SPI1TCZIF_MASK                            0x40
#define _SPI1INTF_SPI1SRMTIF_POSN                           0x7
#define _SPI1INTF_SPI1SRMTIF_POSITION                       0x7
#define _SPI1INTF_SPI1SRMTIF_SIZE                           0x1
#define _SPI1INTF_SPI1SRMTIF_LENGTH                         0x1
#define _SPI1INTF_SPI1SRMTIF_MASK                           0x80

// Register: SPI1INTE
#define SPI1INTE SPI1INTE
extern volatile unsigned char           SPI1INTE            __at(0x1E2);
#ifndef _LIB_BUILD
asm("SPI1INTE equ 01E2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TXUIE                  :1;
        unsigned RXOIE                  :1;
        unsigned                        :1;
        unsigned EOSIE                  :1;
        unsigned SOSIE                  :1;
        unsigned TCZIE                  :1;
        unsigned SRMTIE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1TXUIE              :1;
        unsigned SPI1RXOIE              :1;
        unsigned                        :1;
        unsigned SPI1EOSIE              :1;
        unsigned SPI1SOSIE              :1;
        unsigned SPI1TCZIE              :1;
        unsigned SPI1SRMTIE             :1;
    };
} SPI1INTEbits_t;
