garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile I2C1CON1bits_t I2C1CON1bits __at(0x1E7);
// bitfield macros
#define _I2C1CON1_CSD_POSN                                  0x0
#define _I2C1CON1_CSD_POSITION                              0x0
#define _I2C1CON1_CSD_SIZE                                  0x1
#define _I2C1CON1_CSD_LENGTH                                0x1
#define _I2C1CON1_CSD_MASK                                  0x1
#define _I2C1CON1_TXU_POSN                                  0x1
#define _I2C1CON1_TXU_POSITION                              0x1
#define _I2C1CON1_TXU_SIZE                                  0x1
#define _I2C1CON1_TXU_LENGTH                                0x1
#define _I2C1CON1_TXU_MASK                                  0x2
#define _I2C1CON1_RXO_POSN                                  0x2
#define _I2C1CON1_RXO_POSITION                              0x2
#define _I2C1CON1_RXO_SIZE                                  0x1
#define _I2C1CON1_RXO_LENGTH                                0x1
#define _I2C1CON1_RXO_MASK                                  0x4
#define _I2C1CON1_P_POSN                                    0x3
#define _I2C1CON1_P_POSITION                                0x3
#define _I2C1CON1_P_SIZE                                    0x1
#define _I2C1CON1_P_LENGTH                                  0x1
#define _I2C1CON1_P_MASK                                    0x8
#define _I2C1CON1_ACKT_POSN                                 0x4
#define _I2C1CON1_ACKT_POSITION                             0x4
#define _I2C1CON1_ACKT_SIZE                                 0x1
#define _I2C1CON1_ACKT_LENGTH                               0x1
#define _I2C1CON1_ACKT_MASK                                 0x10
#define _I2C1CON1_ACKSTAT_POSN                              0x5
#define _I2C1CON1_ACKSTAT_POSITION                          0x5
#define _I2C1CON1_ACKSTAT_SIZE                              0x1
#define _I2C1CON1_ACKSTAT_LENGTH                            0x1
#define _I2C1CON1_ACKSTAT_MASK                              0x20
#define _I2C1CON1_ACKDT_POSN                                0x6
#define _I2C1CON1_ACKDT_POSITION                            0x6
#define _I2C1CON1_ACKDT_SIZE                                0x1
#define _I2C1CON1_ACKDT_LENGTH                              0x1
#define _I2C1CON1_ACKDT_MASK                                0x40
#define _I2C1CON1_ACKCNT_POSN                               0x7
#define _I2C1CON1_ACKCNT_POSITION                           0x7
#define _I2C1CON1_ACKCNT_SIZE                               0x1
#define _I2C1CON1_ACKCNT_LENGTH                             0x1
#define _I2C1CON1_ACKCNT_MASK                               0x80

// Register: I2C1CON2
#define I2C1CON2 I2C1CON2
extern volatile unsigned char           I2C1CON2            __at(0x1E8);
#ifndef _LIB_BUILD
asm("I2C1CON2 equ 01E8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BFRET                  :2;
        unsigned SDAHT                  :2;
        unsigned ABD                    :1;
        unsigned                        :1;
        unsigned GCEN                   :1;
        unsigned ACNT                   :1;
    };
    struct {
        unsigned BFRET0                 :1;
        unsigned BFRET1                 :1;
        unsigned SDAHT0                 :1;
        unsigned SDAHT1                 :1;
    };
} I2C1CON2bits_t;
extern volatile I2C1CON2bits_t I2C1CON2bits __at(0x1E8);
// bitfield macros
#define _I2C1CON2_BFRET_POSN                                0x0
#define _I2C1CON2_BFRET_POSITION                            0x0
#define _I2C1CON2_BFRET_SIZE                                0x2
#define _I2C1CON2_BFRET_LENGTH                              0x2
#define _I2C1CON2_BFRET_MASK                                0x3
#define _I2C1CON2_SDAHT_POSN                                0x2
#define _I2C1CON2_SDAHT_POSITION                            0x2
#define _I2C1CON2_SDAHT_SIZE                                0x2
#define _I2C1CON2_SDAHT_LENGTH                              0x2
#define _I2C1CON2_SDAHT_MASK                                0xC
#define _I2C1CON2_ABD_POSN                                  0x4
#define _I2C1CON2_ABD_POSITION                              0x4
#define _I2C1CON2_ABD_SIZE                                  0x1
#define _I2C1CON2_ABD_LENGTH                                0x1
#define _I2C1CON2_ABD_MASK                                  0x10
#define _I2C1CON2_GCEN_POSN                                 0x6
#define _I2C1CON2_GCEN_POSITION                             0x6
#define _I2C1CON2_GCEN_SIZE                                 0x1
#define _I2C1CON2_GCEN_LENGTH                               0x1
#define _I2C1CON2_GCEN_MASK                                 0x40
#define _I2C1CON2_ACNT_POSN                                 0x7
#define _I2C1CON2_ACNT_POSITION                             0x7
#define _I2C1CON2_ACNT_SIZE                                 0x1
#define _I2C1CON2_ACNT_LENGTH                               0x1
#define _I2C1CON2_ACNT_MASK                                 0x80
#define _I2C1CON2_BFRET0_POSN                               0x0
#define _I2C1CON2_BFRET0_POSITION                           0x0
#define _I2C1CON2_BFRET0_SIZE                               0x1
#define _I2C1CON2_BFRET0_LENGTH                             0x1
#define _I2C1CON2_BFRET0_MASK                               0x1
#define _I2C1CON2_BFRET1_POSN                               0x1
#define _I2C1CON2_BFRET1_POSITION                           0x1
#define _I2C1CON2_BFRET1_SIZE                               0x1
#define _I2C1CON2_BFRET1_LENGTH                             0x1
#define _I2C1CON2_BFRET1_MASK                               0x2
#define _I2C1CON2_SDAHT0_POSN                               0x2
#define _I2C1CON2_SDAHT0_POSITION                           0x2
#define _I2C1CON2_SDAHT0_SIZE                               0x1
#define _I2C1CON2_SDAHT0_LENGTH                             0x1
#define _I2C1CON2_SDAHT0_MASK                               0x4
#define _I2C1CON2_SDAHT1_POSN                               0x3
#define _I2C1CON2_SDAHT1_POSITION                           0x3
#define _I2C1CON2_SDAHT1_SIZE                               0x1
#define _I2C1CON2_SDAHT1_LENGTH                             0x1
#define _I2C1CON2_SDAHT1_MASK                               0x8

// Register: I2C1CON3
#define I2C1CON3 I2C1CON3
extern volatile unsigned char           I2C1CON3            __at(0x1E9);
#ifndef _LIB_BUILD
asm("I2C1CON3 equ 01E9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACNTMD                 :2;
        unsigned FME                    :2;
        unsigned BFREDR                 :1;
    };
    struct {
        unsigned ACNTMD0                :1;
        unsigned ACNTMD1                :1;
        unsigned FME0                   :1;
        unsigned FME1                   :1;
    };
} I2C1CON3bits_t;
extern volatile I2C1CON3bits_t I2C1CON3bits __at(0x1E9);
// bitfield macros
#define _I2C1CON3_ACNTMD_POSN                               0x0
#define _I2C1CON3_ACNTMD_POSITION                           0x0
#define _I2C1CON3_ACNTMD_SIZE                               0x2
#define _I2C1CON3_ACNTMD_LENGTH                             0x2
#define _I2C1CON3_ACNTMD_MASK                               0x3
#define _I2C1CON3_FME_POSN                                  0x2
#define _I2C1CON3_FME_POSITION                              0x2
#define _I2C1CON3_FME_SIZE                                  0x2
#define _I2C1CON3_FME_LENGTH                                0x2
#define _I2C1CON3_FME_MASK                                  0xC
#define _I2C1CON3_BFREDR_POSN                               0x4
#define _I2C1CON3_BFREDR_POSITION                           0x4
#define _I2C1CON3_BFREDR_SIZE                               0x1
#define _I2C1CON3_BFREDR_LENGTH                             0x1
#define _I2C1CON3_BFREDR_MASK                               0x10
#define _I2C1CON3_ACNTMD0_POSN                              0x0
#define _I2C1CON3_ACNTMD0_POSITION                          0x0
#define _I2C1CON3_ACNTMD0_SIZE                              0x1
#define _I2C1CON3_ACNTMD0_LENGTH                            0x1
#define _I2C1CON3_ACNTMD0_MASK                              0x1
#define _I2C1CON3_ACNTMD1_POSN                              0x1
#define _I2C1CON3_ACNTMD1_POSITION                          0x1
#define _I2C1CON3_ACNTMD1_SIZE                              0x1
#define _I2C1CON3_ACNTMD1_LENGTH                            0x1
#define _I2C1CON3_ACNTMD1_MASK                              0x2
#define _I2C1CON3_FME0_POSN                                 0x2
#define _I2C1CON3_FME0_POSITION                             0x2
#define _I2C1CON3_FME0_SIZE                                 0x1
#define _I2C1CON3_FME0_LENGTH                               0x1
#define _I2C1CON3_FME0_MASK                                 0x4
#define _I2C1CON3_FME1_POSN                                 0x3
#define _I2C1CON3_FME1_POSITION                             0x3
#define _I2C1CON3_FME1_SIZE                                 0x1
#define _I2C1CON3_FME1_LENGTH                               0x1
#define _I2C1CON3_FME1_MASK                                 0x8

// Register: I2C1PIR
#define I2C1PIR I2C1PIR
extern volatile unsigned char           I2C1PIR             __at(0x1EA);
#ifndef _LIB_BUILD
asm("I2C1PIR equ 01EAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIF                   :1;
        unsigned RSCIF                  :1;
        unsigned PCIF                   :1;
        unsigned ADRIF                  :1;
        unsigned WRIF                   :1;
        unsigned                        :1;
        unsigned ACKTIF                 :1;
        unsigned CNTIF                  :1;
    };
    struct {
        unsigned SC1IF                  :1;
        unsigned RSC1IF                 :1;
        unsigned PC1IF                  :1;
        unsigned ADR1IF                 :1;
        unsigned WR1IF                  :1;
        unsigned                        :1;
        unsigned ACKT1IF                :1;
        unsigned CNT1IF                 :1;
    };
} I2C1PIRbits_t;
extern volatile I2C1PIRbits_t I2C1PIRbits __at(0x1EA);
// bitfield macros
#define _I2C1PIR_SCIF_POSN                                  0x0
#define _I2C1PIR_SCIF_POSITION                              0x0
#define _I2C1PIR_SCIF_SIZE                                  0x1
#define _I2C1PIR_SCIF_LENGTH                                0x1
#define _I2C1PIR_SCIF_MASK                                  0x1
#define _I2C1PIR_RSCIF_POSN                                 0x1
#define _I2C1PIR_RSCIF_POSITION                             0x1
#define _I2C1PIR_RSCIF_SIZE                                 0x1
#define _I2C1PIR_RSCIF_LENGTH                               0x1
#define _I2C1PIR_RSCIF_MASK                                 0x2
#define _I2C1PIR_PCIF_POSN                                  0x2
#define _I2C1PIR_PCIF_POSITION                              0x2
#define _I2C1PIR_PCIF_SIZE                                  0x1
#define _I2C1PIR_PCIF_LENGTH                                0x1
#define _I2C1PIR_PCIF_MASK                                  0x4
#define _I2C1PIR_ADRIF_POSN                                 0x3
#define _I2C1PIR_ADRIF_POSITION                             0x3
#define _I2C1PIR_ADRIF_SIZE                                 0x1
#define _I2C1PIR_ADRIF_LENGTH                               0x1
#define _I2C1PIR_ADRIF_MASK                                 0x8
#define _I2C1PIR_WRIF_POSN                                  0x4
#define _I2C1PIR_WRIF_POSITION                              0x4
#define _I2C1PIR_WRIF_SIZE                                  0x1
#define _I2C1PIR_WRIF_LENGTH                                0x1
#define _I2C1PIR_WRIF_MASK                                  0x10
#define _I2C1PIR_ACKTIF_POSN                                0x6
#define _I2C1PIR_ACKTIF_POSITION                            0x6
#define _I2C1PIR_ACKTIF_SIZE                                0x1
#define _I2C1PIR_ACKTIF_LENGTH                              0x1
#define _I2C1PIR_ACKTIF_MASK                                0x40
#define _I2C1PIR_CNTIF_POSN                                 0x7
#define _I2C1PIR_CNTIF_POSITION                             0x7
#define _I2C1PIR_CNTIF_SIZE                                 0x1
#define _I2C1PIR_CNTIF_LENGTH                               0x1
#define _I2C1PIR_CNTIF_MASK                                 0x80
#define _I2C1PIR_SC1IF_POSN                                 0x0
#define _I2C1PIR_SC1IF_POSITION                             0x0
#define _I2C1PIR_SC1IF_SIZE                                 0x1
#define _I2C1PIR_SC1IF_LENGTH                               0x1
#define _I2C1PIR_SC1IF_MASK                                 0x1
#define _I2C1PIR_RSC1IF_POSN                                0x1
#define _I2C1PIR_RSC1IF_POSITION                            0x1
#define _I2C1PIR_RSC1IF_SIZE                                0x1
#define _I2C1PIR_RSC1IF_LENGTH                              0x1
#define _I2C1PIR_RSC1IF_MASK                                0x2
#define _I2C1PIR_PC1IF_POSN                                 0x2
#define _I2C1PIR_PC1IF_POSITION                             0x2
#define _I2C1PIR_PC1IF_SIZE                                 0x1
#define _I2C1PIR_PC1IF_LENGTH                               0x1
#define _I2C1PIR_PC1IF_MASK                                 0x4
#define _I2C1PIR_ADR1IF_POSN                                0x3
#define _I2C1PIR_ADR1IF_POSITION                            0x3
#define _I2C1PIR_ADR1IF_SIZE                                0x1
#define _I2C1PIR_ADR1IF_LENGTH                              0x1
#define _I2C1PIR_ADR1IF_MASK                                0x8
#define _I2C1PIR_WR1IF_POSN                                 0x4
#define _I2C1PIR_WR1IF_POSITION                             0x4
#define _I2C1PIR_WR1IF_SIZE                                 0x1
#define _I2C1PIR_WR1IF_LENGTH                               0x1
#define _I2C1PIR_WR1IF_MASK                                 0x10
#define _I2C1PIR_ACKT1IF_POSN                               0x6
#define _I2C1PIR_ACKT1IF_POSITION                           0x6
#define _I2C1PIR_ACKT1IF_SIZE                               0x1
#define _I2C1PIR_ACKT1IF_LENGTH                             0x1
#define _I2C1PIR_ACKT1IF_MASK                               0x40
#define _I2C1PIR_CNT1IF_POSN                                0x7
#define _I2C1PIR_CNT1IF_POSITION                            0x7
#define _I2C1PIR_CNT1IF_SIZE                                0x1
#define _I2C1PIR_CNT1IF_LENGTH                              0x1
#define _I2C1PIR_CNT1IF_MASK                                0x80

