garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x470);
#ifndef _LIB_BUILD
asm("PIR7 equ 0470h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned I2C1RXIF               :1;
        unsigned I2C1TXIF               :1;
        unsigned I2C1IF                 :1;
        unsigned I2C1EIF                :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x470);
// bitfield macros
#define _PIR7_SPI1RXIF_POSN                                 0x0
#define _PIR7_SPI1RXIF_POSITION                             0x0
#define _PIR7_SPI1RXIF_SIZE                                 0x1
#define _PIR7_SPI1RXIF_LENGTH                               0x1
#define _PIR7_SPI1RXIF_MASK                                 0x1
#define _PIR7_SPI1TXIF_POSN                                 0x1
#define _PIR7_SPI1TXIF_POSITION                             0x1
#define _PIR7_SPI1TXIF_SIZE                                 0x1
#define _PIR7_SPI1TXIF_LENGTH                               0x1
#define _PIR7_SPI1TXIF_MASK                                 0x2
#define _PIR7_SPI1IF_POSN                                   0x2
#define _PIR7_SPI1IF_POSITION                               0x2
#define _PIR7_SPI1IF_SIZE                                   0x1
#define _PIR7_SPI1IF_LENGTH                                 0x1
#define _PIR7_SPI1IF_MASK                                   0x4
#define _PIR7_I2C1RXIF_POSN                                 0x3
#define _PIR7_I2C1RXIF_POSITION                             0x3
#define _PIR7_I2C1RXIF_SIZE                                 0x1
#define _PIR7_I2C1RXIF_LENGTH                               0x1
#define _PIR7_I2C1RXIF_MASK                                 0x8
#define _PIR7_I2C1TXIF_POSN                                 0x4
#define _PIR7_I2C1TXIF_POSITION                             0x4
#define _PIR7_I2C1TXIF_SIZE                                 0x1
#define _PIR7_I2C1TXIF_LENGTH                               0x1
#define _PIR7_I2C1TXIF_MASK                                 0x10
#define _PIR7_I2C1IF_POSN                                   0x5
#define _PIR7_I2C1IF_POSITION                               0x5
#define _PIR7_I2C1IF_SIZE                                   0x1
#define _PIR7_I2C1IF_LENGTH                                 0x1
#define _PIR7_I2C1IF_MASK                                   0x20
#define _PIR7_I2C1EIF_POSN                                  0x6
#define _PIR7_I2C1EIF_POSITION                              0x6
#define _PIR7_I2C1EIF_SIZE                                  0x1
#define _PIR7_I2C1EIF_LENGTH                                0x1
#define _PIR7_I2C1EIF_MASK                                  0x40

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x471);
#ifndef _LIB_BUILD
asm("PIR8 equ 0471h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I3C1RXIF               :1;
        unsigned I3C1TXIF               :1;
        unsigned I3C1IF                 :1;
        unsigned I3C1EIF                :1;
        unsigned I3C1RIF                :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0x471);
// bitfield macros
#define _PIR8_I3C1RXIF_POSN                                 0x0
#define _PIR8_I3C1RXIF_POSITION                             0x0
#define _PIR8_I3C1RXIF_SIZE                                 0x1
#define _PIR8_I3C1RXIF_LENGTH                               0x1
#define _PIR8_I3C1RXIF_MASK                                 0x1
#define _PIR8_I3C1TXIF_POSN                                 0x1
#define _PIR8_I3C1TXIF_POSITION                             0x1
#define _PIR8_I3C1TXIF_SIZE                                 0x1
#define _PIR8_I3C1TXIF_LENGTH                               0x1
#define _PIR8_I3C1TXIF_MASK                                 0x2
#define _PIR8_I3C1IF_POSN                                   0x2
#define _PIR8_I3C1IF_POSITION                               0x2
#define _PIR8_I3C1IF_SIZE                                   0x1
#define _PIR8_I3C1IF_LENGTH                                 0x1
#define _PIR8_I3C1IF_MASK                                   0x4
#define _PIR8_I3C1EIF_POSN                                  0x3
#define _PIR8_I3C1EIF_POSITION                              0x3
#define _PIR8_I3C1EIF_SIZE                                  0x1
#define _PIR8_I3C1EIF_LENGTH                                0x1
#define _PIR8_I3C1EIF_MASK                                  0x8
#define _PIR8_I3C1RIF_POSN                                  0x4
#define _PIR8_I3C1RIF_POSITION                              0x4
#define _PIR8_I3C1RIF_SIZE                                  0x1
#define _PIR8_I3C1RIF_LENGTH                                0x1
#define _PIR8_I3C1RIF_MASK                                  0x10

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0x472);
#ifndef _LIB_BUILD
asm("PIR9 equ 0472h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I3C2RXIF               :1;
        unsigned I3C2TXIF               :1;
        unsigned I3C2IF                 :1;
        unsigned I3C2EIF                :1;
        unsigned I3C2RIF                :1;
        unsigned HLVDIF                 :1;
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0x472);
// bitfield macros
#define _PIR9_I3C2RXIF_POSN                                 0x0
#define _PIR9_I3C2RXIF_POSITION                             0x0
#define _PIR9_I3C2RXIF_SIZE                                 0x1
#define _PIR9_I3C2RXIF_LENGTH                               0x1
#define _PIR9_I3C2RXIF_MASK                                 0x1
#define _PIR9_I3C2TXIF_POSN                                 0x1
#define _PIR9_I3C2TXIF_POSITION                             0x1
#define _PIR9_I3C2TXIF_SIZE                                 0x1
#define _PIR9_I3C2TXIF_LENGTH                               0x1
#define _PIR9_I3C2TXIF_MASK                                 0x2
#define _PIR9_I3C2IF_POSN                                   0x2
#define _PIR9_I3C2IF_POSITION                               0x2
#define _PIR9_I3C2IF_SIZE                                   0x1
#define _PIR9_I3C2IF_LENGTH                                 0x1
#define _PIR9_I3C2IF_MASK                                   0x4
#define _PIR9_I3C2EIF_POSN                                  0x3
#define _PIR9_I3C2EIF_POSITION                              0x3
#define _PIR9_I3C2EIF_SIZE                                  0x1
#define _PIR9_I3C2EIF_LENGTH                                0x1
#define _PIR9_I3C2EIF_MASK                                  0x8
#define _PIR9_I3C2RIF_POSN                                  0x4
#define _PIR9_I3C2RIF_POSITION                              0x4
#define _PIR9_I3C2RIF_SIZE                                  0x1
#define _PIR9_I3C2RIF_LENGTH                                0x1
#define _PIR9_I3C2RIF_MASK                                  0x10
#define _PIR9_HLVDIF_POSN                                   0x5
#define _PIR9_HLVDIF_POSITION                               0x5
#define _PIR9_HLVDIF_SIZE                                   0x1
#define _PIR9_HLVDIF_LENGTH                                 0x1
#define _PIR9_HLVDIF_MASK                                   0x20
#define _PIR9_ADIF_POSN                                     0x6
#define _PIR9_ADIF_POSITION                                 0x6
#define _PIR9_ADIF_SIZE                                     0x1
#define _PIR9_ADIF_LENGTH                                   0x1
#define _PIR9_ADIF_MASK                                     0x40
#define _PIR9_ADTIF_POSN                                    0x7
#define _PIR9_ADTIF_POSITION                                0x7
#define _PIR9_ADTIF_SIZE                                    0x1
#define _PIR9_ADTIF_LENGTH                                  0x1
#define _PIR9_ADTIF_MASK                                    0x80

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x473);
#ifndef _LIB_BUILD
asm("PIE0 equ 0473h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIE                   :1;
        unsigned INT0IE                 :1;
        unsigned INT1IE                 :1;
        unsigned INT2IE                 :1;
        unsigned DMA1SCNTIE             :1;
        unsigned DMA1DCNTIE             :1;
        unsigned DMA1ORIE               :1;
        unsigned DMA1AIE                :1;
    };
} PIE0bits_t;
