garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile IPR2bits_t IPR2bits __at(0x47F);
// bitfield macros
#define _IPR2_DMA4SCNTIP_POSN                               0x0
#define _IPR2_DMA4SCNTIP_POSITION                           0x0
#define _IPR2_DMA4SCNTIP_SIZE                               0x1
#define _IPR2_DMA4SCNTIP_LENGTH                             0x1
#define _IPR2_DMA4SCNTIP_MASK                               0x1
#define _IPR2_DMA4DCNTIP_POSN                               0x1
#define _IPR2_DMA4DCNTIP_POSITION                           0x1
#define _IPR2_DMA4DCNTIP_SIZE                               0x1
#define _IPR2_DMA4DCNTIP_LENGTH                             0x1
#define _IPR2_DMA4DCNTIP_MASK                               0x2
#define _IPR2_DMA4ORIP_POSN                                 0x2
#define _IPR2_DMA4ORIP_POSITION                             0x2
#define _IPR2_DMA4ORIP_SIZE                                 0x1
#define _IPR2_DMA4ORIP_LENGTH                               0x1
#define _IPR2_DMA4ORIP_MASK                                 0x4
#define _IPR2_DMA4AIP_POSN                                  0x3
#define _IPR2_DMA4AIP_POSITION                              0x3
#define _IPR2_DMA4AIP_SIZE                                  0x1
#define _IPR2_DMA4AIP_LENGTH                                0x1
#define _IPR2_DMA4AIP_MASK                                  0x8
#define _IPR2_NVMIP_POSN                                    0x4
#define _IPR2_NVMIP_POSITION                                0x4
#define _IPR2_NVMIP_SIZE                                    0x1
#define _IPR2_NVMIP_LENGTH                                  0x1
#define _IPR2_NVMIP_MASK                                    0x10
#define _IPR2_CRCIP_POSN                                    0x5
#define _IPR2_CRCIP_POSITION                                0x5
#define _IPR2_CRCIP_SIZE                                    0x1
#define _IPR2_CRCIP_LENGTH                                  0x1
#define _IPR2_CRCIP_MASK                                    0x20
#define _IPR2_SCANIP_POSN                                   0x6
#define _IPR2_SCANIP_POSITION                               0x6
#define _IPR2_SCANIP_SIZE                                   0x1
#define _IPR2_SCANIP_LENGTH                                 0x1
#define _IPR2_SCANIP_MASK                                   0x40
#define _IPR2_ACTIP_POSN                                    0x7
#define _IPR2_ACTIP_POSITION                                0x7
#define _IPR2_ACTIP_SIZE                                    0x1
#define _IPR2_ACTIP_LENGTH                                  0x1
#define _IPR2_ACTIP_MASK                                    0x80

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0x480);
#ifndef _LIB_BUILD
asm("IPR3 equ 0480h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSWIP                  :1;
        unsigned OSFIP                  :1;
        unsigned VDDIO2IP               :1;
        unsigned VDDIO3IP               :1;
        unsigned IOCIP                  :1;
        unsigned TMR0IP                 :1;
        unsigned TMR1IP                 :1;
        unsigned TMR1GIP                :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0x480);
// bitfield macros
#define _IPR3_CSWIP_POSN                                    0x0
#define _IPR3_CSWIP_POSITION                                0x0
#define _IPR3_CSWIP_SIZE                                    0x1
#define _IPR3_CSWIP_LENGTH                                  0x1
#define _IPR3_CSWIP_MASK                                    0x1
#define _IPR3_OSFIP_POSN                                    0x1
#define _IPR3_OSFIP_POSITION                                0x1
#define _IPR3_OSFIP_SIZE                                    0x1
#define _IPR3_OSFIP_LENGTH                                  0x1
#define _IPR3_OSFIP_MASK                                    0x2
#define _IPR3_VDDIO2IP_POSN                                 0x2
#define _IPR3_VDDIO2IP_POSITION                             0x2
#define _IPR3_VDDIO2IP_SIZE                                 0x1
#define _IPR3_VDDIO2IP_LENGTH                               0x1
#define _IPR3_VDDIO2IP_MASK                                 0x4
#define _IPR3_VDDIO3IP_POSN                                 0x3
#define _IPR3_VDDIO3IP_POSITION                             0x3
#define _IPR3_VDDIO3IP_SIZE                                 0x1
#define _IPR3_VDDIO3IP_LENGTH                               0x1
#define _IPR3_VDDIO3IP_MASK                                 0x8
#define _IPR3_IOCIP_POSN                                    0x4
#define _IPR3_IOCIP_POSITION                                0x4
#define _IPR3_IOCIP_SIZE                                    0x1
#define _IPR3_IOCIP_LENGTH                                  0x1
#define _IPR3_IOCIP_MASK                                    0x10
#define _IPR3_TMR0IP_POSN                                   0x5
#define _IPR3_TMR0IP_POSITION                               0x5
#define _IPR3_TMR0IP_SIZE                                   0x1
#define _IPR3_TMR0IP_LENGTH                                 0x1
#define _IPR3_TMR0IP_MASK                                   0x20
#define _IPR3_TMR1IP_POSN                                   0x6
#define _IPR3_TMR1IP_POSITION                               0x6
#define _IPR3_TMR1IP_SIZE                                   0x1
#define _IPR3_TMR1IP_LENGTH                                 0x1
#define _IPR3_TMR1IP_MASK                                   0x40
#define _IPR3_TMR1GIP_POSN                                  0x7
#define _IPR3_TMR1GIP_POSITION                              0x7
#define _IPR3_TMR1GIP_SIZE                                  0x1
#define _IPR3_TMR1GIP_LENGTH                                0x1
#define _IPR3_TMR1GIP_MASK                                  0x80

// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0x481);
#ifndef _LIB_BUILD
asm("IPR4 equ 0481h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR2IP                 :1;
        unsigned TMR4IP                 :1;
        unsigned TU16AIP                :1;
        unsigned TU16BIP                :1;
        unsigned CCP1IP                 :1;
        unsigned CCP2IP                 :1;
        unsigned PWM1PIP                :1;
        unsigned PWM1IP                 :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0x481);
// bitfield macros
#define _IPR4_TMR2IP_POSN                                   0x0
#define _IPR4_TMR2IP_POSITION                               0x0
#define _IPR4_TMR2IP_SIZE                                   0x1
#define _IPR4_TMR2IP_LENGTH                                 0x1
#define _IPR4_TMR2IP_MASK                                   0x1
#define _IPR4_TMR4IP_POSN                                   0x1
#define _IPR4_TMR4IP_POSITION                               0x1
#define _IPR4_TMR4IP_SIZE                                   0x1
#define _IPR4_TMR4IP_LENGTH                                 0x1
#define _IPR4_TMR4IP_MASK                                   0x2
#define _IPR4_TU16AIP_POSN                                  0x2
#define _IPR4_TU16AIP_POSITION                              0x2
#define _IPR4_TU16AIP_SIZE                                  0x1
#define _IPR4_TU16AIP_LENGTH                                0x1
#define _IPR4_TU16AIP_MASK                                  0x4
#define _IPR4_TU16BIP_POSN                                  0x3
#define _IPR4_TU16BIP_POSITION                              0x3
#define _IPR4_TU16BIP_SIZE                                  0x1
#define _IPR4_TU16BIP_LENGTH                                0x1
#define _IPR4_TU16BIP_MASK                                  0x8
#define _IPR4_CCP1IP_POSN                                   0x4
#define _IPR4_CCP1IP_POSITION                               0x4
#define _IPR4_CCP1IP_SIZE                                   0x1
#define _IPR4_CCP1IP_LENGTH                                 0x1
#define _IPR4_CCP1IP_MASK                                   0x10
#define _IPR4_CCP2IP_POSN                                   0x5
#define _IPR4_CCP2IP_POSITION                               0x5
#define _IPR4_CCP2IP_SIZE                                   0x1
#define _IPR4_CCP2IP_LENGTH                                 0x1
#define _IPR4_CCP2IP_MASK                                   0x20
#define _IPR4_PWM1PIP_POSN                                  0x6
#define _IPR4_PWM1PIP_POSITION                              0x6
#define _IPR4_PWM1PIP_SIZE                                  0x1
#define _IPR4_PWM1PIP_LENGTH                                0x1
#define _IPR4_PWM1PIP_MASK                                  0x40
#define _IPR4_PWM1IP_POSN                                   0x7
#define _IPR4_PWM1IP_POSITION                               0x7
#define _IPR4_PWM1IP_SIZE                                   0x1
#define _IPR4_PWM1IP_LENGTH                                 0x1
#define _IPR4_PWM1IP_MASK                                   0x80

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0x482);
#ifndef _LIB_BUILD
asm("IPR5 equ 0482h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2PIP                :1;
        unsigned PWM2IP                 :1;
        unsigned CWG1IP                 :1;
        unsigned CLC1IP                 :1;
        unsigned CLC2IP                 :1;
        unsigned CLC3IP                 :1;
        unsigned CLC4IP                 :1;
        unsigned IOCSRIP                :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0x482);
// bitfield macros
#define _IPR5_PWM2PIP_POSN                                  0x0
#define _IPR5_PWM2PIP_POSITION                              0x0
#define _IPR5_PWM2PIP_SIZE                                  0x1
#define _IPR5_PWM2PIP_LENGTH                                0x1
#define _IPR5_PWM2PIP_MASK                                  0x1
#define _IPR5_PWM2IP_POSN                                   0x1
#define _IPR5_PWM2IP_POSITION                               0x1
#define _IPR5_PWM2IP_SIZE                                   0x1
#define _IPR5_PWM2IP_LENGTH                                 0x1
#define _IPR5_PWM2IP_MASK                                   0x2
#define _IPR5_CWG1IP_POSN                                   0x2
#define _IPR5_CWG1IP_POSITION                               0x2
#define _IPR5_CWG1IP_SIZE                                   0x1
#define _IPR5_CWG1IP_LENGTH                                 0x1
#define _IPR5_CWG1IP_MASK                                   0x4
#define _IPR5_CLC1IP_POSN                                   0x3
#define _IPR5_CLC1IP_POSITION                               0x3
#define _IPR5_CLC1IP_SIZE                                   0x1
#define _IPR5_CLC1IP_LENGTH                                 0x1
#define _IPR5_CLC1IP_MASK                                   0x8
#define _IPR5_CLC2IP_POSN                                   0x4
#define _IPR5_CLC2IP_POSITION                               0x4
#define _IPR5_CLC2IP_SIZE                                   0x1
#define _IPR5_CLC2IP_LENGTH                                 0x1
#define _IPR5_CLC2IP_MASK                                   0x10
#define _IPR5_CLC3IP_POSN                                   0x5
#define _IPR5_CLC3IP_POSITION                               0x5
#define _IPR5_CLC3IP_SIZE                                   0x1
#define _IPR5_CLC3IP_LENGTH                                 0x1
#define _IPR5_CLC3IP_MASK                                   0x20
#define _IPR5_CLC4IP_POSN                                   0x6
#define _IPR5_CLC4IP_POSITION                               0x6
#define _IPR5_CLC4IP_SIZE                                   0x1
#define _IPR5_CLC4IP_LENGTH                                 0x1
#define _IPR5_CLC4IP_MASK                                   0x40
#define _IPR5_IOCSRIP_POSN                                  0x7
#define _IPR5_IOCSRIP_POSITION                              0x7
#define _IPR5_IOCSRIP_SIZE                                  0x1
#define _IPR5_IOCSRIP_LENGTH                                0x1
#define _IPR5_IOCSRIP_MASK                                  0x80

