garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile LATWbits_t LATWbits __at(0x49A);
// bitfield macros
#define _LATW_LATW0_POSN                                    0x0
#define _LATW_LATW0_POSITION                                0x0
#define _LATW_LATW0_SIZE                                    0x1
#define _LATW_LATW0_LENGTH                                  0x1
#define _LATW_LATW0_MASK                                    0x1
#define _LATW_LATW1_POSN                                    0x1
#define _LATW_LATW1_POSITION                                0x1
#define _LATW_LATW1_SIZE                                    0x1
#define _LATW_LATW1_LENGTH                                  0x1
#define _LATW_LATW1_MASK                                    0x2
#define _LATW_LATW2_POSN                                    0x2
#define _LATW_LATW2_POSITION                                0x2
#define _LATW_LATW2_SIZE                                    0x1
#define _LATW_LATW2_LENGTH                                  0x1
#define _LATW_LATW2_MASK                                    0x4
#define _LATW_LATW3_POSN                                    0x3
#define _LATW_LATW3_POSITION                                0x3
#define _LATW_LATW3_SIZE                                    0x1
#define _LATW_LATW3_LENGTH                                  0x1
#define _LATW_LATW3_MASK                                    0x8
#define _LATW_LATW4_POSN                                    0x4
#define _LATW_LATW4_POSITION                                0x4
#define _LATW_LATW4_SIZE                                    0x1
#define _LATW_LATW4_LENGTH                                  0x1
#define _LATW_LATW4_MASK                                    0x10
#define _LATW_LATW5_POSN                                    0x5
#define _LATW_LATW5_POSITION                                0x5
#define _LATW_LATW5_SIZE                                    0x1
#define _LATW_LATW5_LENGTH                                  0x1
#define _LATW_LATW5_MASK                                    0x20
#define _LATW_LATW6_POSN                                    0x6
#define _LATW_LATW6_POSITION                                0x6
#define _LATW_LATW6_SIZE                                    0x1
#define _LATW_LATW6_LENGTH                                  0x1
#define _LATW_LATW6_MASK                                    0x40
#define _LATW_LATW7_POSN                                    0x7
#define _LATW_LATW7_POSITION                                0x7
#define _LATW_LATW7_SIZE                                    0x1
#define _LATW_LATW7_LENGTH                                  0x1
#define _LATW_LATW7_MASK                                    0x80

// Register: PORTWIN0
#define PORTWIN0 PORTWIN0
extern volatile unsigned char           PORTWIN0            __at(0x49B);
#ifndef _LIB_BUILD
asm("PORTWIN0 equ 049Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN0bits_t;
extern volatile PORTWIN0bits_t PORTWIN0bits __at(0x49B);
// bitfield macros
#define _PORTWIN0_IN_POSN                                   0x0
#define _PORTWIN0_IN_POSITION                               0x0
#define _PORTWIN0_IN_SIZE                                   0x8
#define _PORTWIN0_IN_LENGTH                                 0x8
#define _PORTWIN0_IN_MASK                                   0xFF
#define _PORTWIN0_IN0_POSN                                  0x0
#define _PORTWIN0_IN0_POSITION                              0x0
#define _PORTWIN0_IN0_SIZE                                  0x1
#define _PORTWIN0_IN0_LENGTH                                0x1
#define _PORTWIN0_IN0_MASK                                  0x1
#define _PORTWIN0_IN1_POSN                                  0x1
#define _PORTWIN0_IN1_POSITION                              0x1
#define _PORTWIN0_IN1_SIZE                                  0x1
#define _PORTWIN0_IN1_LENGTH                                0x1
#define _PORTWIN0_IN1_MASK                                  0x2
#define _PORTWIN0_IN2_POSN                                  0x2
#define _PORTWIN0_IN2_POSITION                              0x2
#define _PORTWIN0_IN2_SIZE                                  0x1
#define _PORTWIN0_IN2_LENGTH                                0x1
#define _PORTWIN0_IN2_MASK                                  0x4

// Register: PORTWIN1
#define PORTWIN1 PORTWIN1
extern volatile unsigned char           PORTWIN1            __at(0x49C);
#ifndef _LIB_BUILD
asm("PORTWIN1 equ 049Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN1bits_t;
extern volatile PORTWIN1bits_t PORTWIN1bits __at(0x49C);
// bitfield macros
#define _PORTWIN1_IN_POSN                                   0x0
#define _PORTWIN1_IN_POSITION                               0x0
#define _PORTWIN1_IN_SIZE                                   0x8
#define _PORTWIN1_IN_LENGTH                                 0x8
#define _PORTWIN1_IN_MASK                                   0xFF
#define _PORTWIN1_IN0_POSN                                  0x0
#define _PORTWIN1_IN0_POSITION                              0x0
#define _PORTWIN1_IN0_SIZE                                  0x1
#define _PORTWIN1_IN0_LENGTH                                0x1
#define _PORTWIN1_IN0_MASK                                  0x1
#define _PORTWIN1_IN1_POSN                                  0x1
#define _PORTWIN1_IN1_POSITION                              0x1
#define _PORTWIN1_IN1_SIZE                                  0x1
#define _PORTWIN1_IN1_LENGTH                                0x1
#define _PORTWIN1_IN1_MASK                                  0x2
#define _PORTWIN1_IN2_POSN                                  0x2
#define _PORTWIN1_IN2_POSITION                              0x2
#define _PORTWIN1_IN2_SIZE                                  0x1
#define _PORTWIN1_IN2_LENGTH                                0x1
#define _PORTWIN1_IN2_MASK                                  0x4

// Register: PORTWIN2
#define PORTWIN2 PORTWIN2
extern volatile unsigned char           PORTWIN2            __at(0x49D);
#ifndef _LIB_BUILD
asm("PORTWIN2 equ 049Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN2bits_t;
