garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile TBLPTRUbits_t TBLPTRUbits __at(0x4F8);
// bitfield macros
#define _TBLPTRU_TBLPTRU_POSN                               0x0
#define _TBLPTRU_TBLPTRU_POSITION                           0x0
#define _TBLPTRU_TBLPTRU_SIZE                               0x6
#define _TBLPTRU_TBLPTRU_LENGTH                             0x6
#define _TBLPTRU_TBLPTRU_MASK                               0x3F

// Register: PCLAT
#define PCLAT PCLAT
#ifndef __CCI__
extern volatile __uint24                PCLAT               __at(0x4F9);
#endif
#ifndef _LIB_BUILD
asm("PCLAT equ 04F9h");
#endif

// Register: PCL
#define PCL PCL
extern volatile unsigned char           PCL                 __at(0x4F9);
#ifndef _LIB_BUILD
asm("PCL equ 04F9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PC                     :8;
    };
} PCLbits_t;
extern volatile PCLbits_t PCLbits __at(0x4F9);
// bitfield macros
#define _PCL_PC_POSN                                        0x0
#define _PCL_PC_POSITION                                    0x0
#define _PCL_PC_SIZE                                        0x8
#define _PCL_PC_LENGTH                                      0x8
#define _PCL_PC_MASK                                        0xFF

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0x4FA);
#ifndef _LIB_BUILD
asm("PCLATH equ 04FAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :8;
    };
} PCLATHbits_t;
extern volatile PCLATHbits_t PCLATHbits __at(0x4FA);
// bitfield macros
#define _PCLATH_PCH_POSN                                    0x0
#define _PCLATH_PCH_POSITION                                0x0
#define _PCLATH_PCH_SIZE                                    0x8
#define _PCLATH_PCH_LENGTH                                  0x8
#define _PCLATH_PCH_MASK                                    0xFF

// Register: PCLATU
#define PCLATU PCLATU
extern volatile unsigned char           PCLATU              __at(0x4FB);
#ifndef _LIB_BUILD
asm("PCLATU equ 04FBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCU                    :5;
    };
} PCLATUbits_t;
extern volatile PCLATUbits_t PCLATUbits __at(0x4FB);
// bitfield macros
#define _PCLATU_PCU_POSN                                    0x0
#define _PCLATU_PCU_POSITION                                0x0
#define _PCLATU_PCU_SIZE                                    0x5
#define _PCLATU_PCU_LENGTH                                  0x5
#define _PCLATU_PCU_MASK                                    0x1F

// Register: STKPTR
#define STKPTR STKPTR
extern volatile unsigned char           STKPTR              __at(0x4FC);
#ifndef _LIB_BUILD
asm("STKPTR equ 04FCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STKPTR                 :7;
    };
} STKPTRbits_t;
extern volatile STKPTRbits_t STKPTRbits __at(0x4FC);
// bitfield macros
#define _STKPTR_STKPTR_POSN                                 0x0
#define _STKPTR_STKPTR_POSITION                             0x0
#define _STKPTR_STKPTR_SIZE                                 0x7
#define _STKPTR_STKPTR_LENGTH                               0x7
#define _STKPTR_STKPTR_MASK                                 0x7F

// Register: TOS
#define TOS TOS
#ifndef __CCI__
extern volatile __uint24                TOS                 __at(0x4FD);
#endif
#ifndef _LIB_BUILD
asm("TOS equ 04FDh");
#endif

// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x4FD);
#ifndef _LIB_BUILD
asm("TOSL equ 04FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x4FD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x4FE);
#ifndef _LIB_BUILD
asm("TOSH equ 04FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0x4FE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0x4FF);
#ifndef _LIB_BUILD
asm("TOSU equ 04FFh");
#endif

/*
 * Register Mirrors in DMA Space
 */

// Register: CCPR1L
#define                                 CCPR1L_M1           0x4000
// Register: CCPR1H
#define                                 CCPR1H_M1           0x4001
// Register: CCPR2L
#define                                 CCPR2L_M1           0x4002
// Register: CCPR2H
#define                                 CCPR2H_M1           0x4003
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M1        0x4006
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M1        0x4007
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M1        0x4008
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M1        0x4009
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M2        0x4010
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M2        0x4011
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M1        0x4012
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M1        0x4013
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M2        0x4014
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M2        0x4015
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M1        0x4016
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M1        0x4017
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M3        0x4020
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M3        0x4021
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M2        0x4022
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M2        0x4023
// Register: PWM1PRL
#define                                 PWM1PRL_M1          0x4024
// Register: PWM1PRH
#define                                 PWM1PRH_M1          0x4025
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M3        0x4026
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M3        0x4027
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M2        0x4028
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M2        0x4029
// Register: PWM2PRL
#define                                 PWM2PRL_M1          0x402A
// Register: PWM2PRH
#define                                 PWM2PRH_M1          0x402B
// Register: CCPR1L
#define                                 CCPR1L_M2           0x4040
// Register: CCPR1H
#define                                 CCPR1H_M2           0x4041
// Register: T2PR
#define                                 T2PR_M1             0x4042
// Register: CCPR2L
#define                                 CCPR2L_M2           0x4043
// Register: CCPR2H
#define                                 CCPR2H_M2           0x4044
// Register: T4PR
#define                                 T4PR_M1             0x4045
// Register: ADLTHL
#define                                 ADLTHL_M1           0x4060
// Register: ADLTHH
#define                                 ADLTHH_M1           0x4061
// Register: ADUTHL
#define                                 ADUTHL_M1           0x4062
// Register: ADUTHH
#define                                 ADUTHH_M1           0x4063
// Register: ADERRL
#define                                 ADERRL_M1           0x4064
// Register: ADERRH
#define                                 ADERRH_M1           0x4065
// Register: ADSTPTL
#define                                 ADSTPTL_M1          0x4066
// Register: ADSTPTH
#define                                 ADSTPTH_M1          0x4067
// Register: ADFLTRL
#define                                 ADFLTRL_M1          0x4068
// Register: ADFLTRH
#define                                 ADFLTRH_M1          0x4069
// Register: ADACCL
#define                                 ADACCL_M1           0x406A
// Register: ADACCH
#define                                 ADACCH_M1           0x406B
// Register: ADCNT
#define                                 ADCNT_M1            0x406D
// Register: ADRPT
#define                                 ADRPT_M1            0x406E
// Register: ADPREVL
#define                                 ADPREVL_M1          0x406F
// Register: ADPREVH
#define                                 ADPREVH_M1          0x4070
// Register: ADACQL
#define                                 ADACQL_M1           0x4071
// Register: ADACQH
#define                                 ADACQH_M1           0x4072
// Register: ADCAP
#define                                 ADCAP_M1            0x4073
// Register: ADCON0
#define                                 ADCON0_M1           0x4074
// Register: ADCON1
#define                                 ADCON1_M1           0x4075
// Register: ADCON2
#define                                 ADCON2_M1           0x4076
// Register: ADCON3
#define                                 ADCON3_M1           0x4077
// Register: ADREF
#define                                 ADREF_M1            0x4078
// Register: ADACT
#define                                 ADACT_M1            0x4079
// Register: ADCLK
#define                                 ADCLK_M1            0x407A
// Register: ADPCH
#define                                 ADPCH_M1            0x407B
// Register: ADRESL
#define                                 ADRESL_M1           0x407C
// Register: ADRESH
#define                                 ADRESH_M1           0x407D
// Register: ADLTHL
#define                                 ADLTHL_M2           0x40E0
// Register: ADLTHH
#define                                 ADLTHH_M2           0x40E1
// Register: ADUTHL
#define                                 ADUTHL_M2           0x40E2
// Register: ADUTHH
#define                                 ADUTHH_M2           0x40E3
// Register: ADERRL
#define                                 ADERRL_M2           0x40E4
// Register: ADERRH
#define                                 ADERRH_M2           0x40E5
// Register: ADSTPTL
#define                                 ADSTPTL_M2          0x40E6
// Register: ADSTPTH
#define                                 ADSTPTH_M2          0x40E7
// Register: ADFLTRL
#define                                 ADFLTRL_M2          0x40E8
// Register: ADFLTRH
#define                                 ADFLTRH_M2          0x40E9
// Register: ADACCL
#define                                 ADACCL_M2           0x40EA
// Register: ADACCH
#define                                 ADACCH_M2           0x40EB
// Register: ADCNT
#define                                 ADCNT_M2            0x40ED
// Register: ADRPT
#define                                 ADRPT_M2            0x40EE
// Register: ADPREVL
#define                                 ADPREVL_M2          0x40EF
// Register: ADPREVH
#define                                 ADPREVH_M2          0x40F0
// Register: ADACQL
#define                                 ADACQL_M2           0x40F1
// Register: ADACQH
#define                                 ADACQH_M2           0x40F2
// Register: ADCAP
#define                                 ADCAP_M2            0x40F3
// Register: ADPCH
#define                                 ADPCH_M2            0x40F4
// Register: ADRESL
#define                                 ADRESL_M2           0x40F5
// Register: ADRESH
#define                                 ADRESH_M2           0x40F6
// Register: DMAnBUF
#define                                 DMAnBUF_DMA1        0x4100
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA1      0x4101
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA1      0x4102
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA1      0x4103
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA1      0x4104
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA1       0x4105
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA1       0x4106
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA1       0x4107
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA1       0x4108
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA1      0x4109
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA1      0x410A
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA1      0x410B
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA1      0x410C
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA1      0x410D
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA1       0x410E
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA1       0x410F
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA1       0x4110
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA1       0x4111
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA1       0x4112
// Register: DMAnCON0
#define                                 DMAnCON0_DMA1       0x4113
// Register: DMAnCON1
#define                                 DMAnCON1_DMA1       0x4114
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA1       0x4115
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA1       0x4116
// Register: DMAnBUF
#define                                 DMAnBUF_DMA2        0x4117
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA2      0x4118
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA2      0x4119
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA2      0x411A
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA2      0x411B
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA2       0x411C
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA2       0x411D
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA2       0x411E
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA2       0x411F
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA2      0x4120
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA2      0x4121
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA2      0x4122
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA2      0x4123
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA2      0x4124
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA2       0x4125
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA2       0x4126
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA2       0x4127
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA2       0x4128
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA2       0x4129
// Register: DMAnCON0
#define                                 DMAnCON0_DMA2       0x412A
// Register: DMAnCON1
#define                                 DMAnCON1_DMA2       0x412B
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA2       0x412C
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA2       0x412D
// Register: DMAnBUF
#define                                 DMAnBUF_DMA3        0x412E
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA3      0x412F
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA3      0x4130
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA3      0x4131
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA3      0x4132
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA3       0x4133
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA3       0x4134
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA3       0x4135
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA3       0x4136
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA3      0x4137
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA3      0x4138
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA3      0x4139
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA3      0x413A
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA3      0x413B
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA3       0x413C
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA3       0x413D
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA3       0x413E
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA3       0x413F
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA3       0x4140
// Register: DMAnCON0
#define                                 DMAnCON0_DMA3       0x4141
// Register: DMAnCON1
#define                                 DMAnCON1_DMA3       0x4142
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA3       0x4143
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA3       0x4144
// Register: DMAnBUF
#define                                 DMAnBUF_DMA4        0x4145
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA4      0x4146
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA4      0x4147
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA4      0x4148
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA4      0x4149
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA4       0x414A
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA4       0x414B
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA4       0x414C
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA4       0x414D
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA4      0x414E
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA4      0x414F
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA4      0x4150
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA4      0x4151
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA4      0x4152
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA4       0x4153
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA4       0x4154
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA4       0x4155
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA4       0x4156
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA4       0x4157
// Register: DMAnCON0
#define                                 DMAnCON0_DMA4       0x4158
// Register: DMAnCON1
#define                                 DMAnCON1_DMA4       0x4159
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA4       0x415A
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA4       0x415B
// Register: IOCAF
#define                                 IOCAF_M1            0x41E0
// Register: IOCBF
#define                                 IOCBF_M1            0x41E1
// Register: IOCCF
#define                                 IOCCF_M1            0x41E2
// Register: IOCWF
#define                                 IOCWF_M1            0x41E4
// Register: TU16APRL
#define                                 TU16APRL_M1         0x41F0
// Register: TU16APRH
#define                                 TU16APRH_M1         0x41F1
// Register: TU16BPRL
#define                                 TU16BPRL_M1         0x41F2
// Register: TU16BPRH
#define                                 TU16BPRH_M1         0x41F3
// Register: TMR1L
#define                                 TMR1L_M1            0x41F6
// Register: TMR1H
#define                                 TMR1H_M1            0x41F7
/*
 * Device Information Area (DIA) Table
 */
extern const unsigned char              _DIA[64]            __at(0x2C0000);

extern const unsigned short             _DIA_MUI[8]         __at(0x2C0000);
#define DIA_MUI                                             0x2C0000
extern const unsigned short             _DIA_MUI0           __at(0x2C0000);
#define DIA_MUI0                                            0x2C0000
extern const unsigned short             _DIA_MUI1           __at(0x2C0002);
#define DIA_MUI1                                            0x2C0002
extern const unsigned short             _DIA_MUI2           __at(0x2C0004);
#define DIA_MUI2                                            0x2C0004
extern const unsigned short             _DIA_MUI3           __at(0x2C0006);
#define DIA_MUI3                                            0x2C0006
extern const unsigned short             _DIA_MUI4           __at(0x2C0008);
#define DIA_MUI4                                            0x2C0008
extern const unsigned short             _DIA_MUI5           __at(0x2C000A);
#define DIA_MUI5                                            0x2C000A
extern const unsigned short             _DIA_MUI6           __at(0x2C000C);
#define DIA_MUI6                                            0x2C000C
extern const unsigned short             _DIA_MUI7           __at(0x2C000E);
#define DIA_MUI7                                            0x2C000E

