garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f16q20.h
extern volatile __bit                   CLKRCLK0            __at(0x808);	// @ (0x101 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x809);	// @ (0x101 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x80A);	// @ (0x101 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x80B);	// @ (0x101 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x803);	// @ (0x100 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x804);	// @ (0x100 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x800);	// @ (0x100 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x801);	// @ (0x100 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x802);	// @ (0x100 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x807);	// @ (0x100 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD1<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x180B);	// @ (0x301 * 8 + 3)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD1,3)
// SPI1CLK<CLKSEL0>
extern volatile __bit                   CLKSEL0             __at(0xF18);	// @ (0x1E3 * 8 + 0)
#define                                 CLKSEL0_bit         _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<CLKSEL1>
extern volatile __bit                   CLKSEL1             __at(0xF19);	// @ (0x1E3 * 8 + 1)
#define                                 CLKSEL1_bit         _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<CLKSEL2>
extern volatile __bit                   CLKSEL2             __at(0xF1A);	// @ (0x1E3 * 8 + 2)
#define                                 CLKSEL2_bit         _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<CLKSEL3>
extern volatile __bit                   CLKSEL3             __at(0xF1B);	// @ (0x1E3 * 8 + 3)
#define                                 CLKSEL3_bit         _BIT_ACCESS(SPI1CLK,3)
// I2C1CNTH<CNT10>
extern volatile __bit                   CNT10               __at(0xF72);	// @ (0x1EE * 8 + 2)
#define                                 CNT10_bit           _BIT_ACCESS(I2C1CNTH,2)
// I2C1CNTH<CNT11>
extern volatile __bit                   CNT11               __at(0xF73);	// @ (0x1EE * 8 + 3)
#define                                 CNT11_bit           _BIT_ACCESS(I2C1CNTH,3)
// I2C1CNTH<CNT12>
extern volatile __bit                   CNT12               __at(0xF74);	// @ (0x1EE * 8 + 4)
#define                                 CNT12_bit           _BIT_ACCESS(I2C1CNTH,4)
// I2C1CNTH<CNT13>
extern volatile __bit                   CNT13               __at(0xF75);	// @ (0x1EE * 8 + 5)
#define                                 CNT13_bit           _BIT_ACCESS(I2C1CNTH,5)
// I2C1CNTH<CNT14>
extern volatile __bit                   CNT14               __at(0xF76);	// @ (0x1EE * 8 + 6)
#define                                 CNT14_bit           _BIT_ACCESS(I2C1CNTH,6)
// I2C1CNTH<CNT15>
extern volatile __bit                   CNT15               __at(0xF77);	// @ (0x1EE * 8 + 7)
#define                                 CNT15_bit           _BIT_ACCESS(I2C1CNTH,7)
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0xF5F);	// @ (0x1EB * 8 + 7)
#define                                 CNT1IE_bit          _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0xF57);	// @ (0x1EA * 8 + 7)
#define                                 CNT1IF_bit          _BIT_ACCESS(I2C1PIR,7)
// I2C1CNTH<CNT8>
extern volatile __bit                   CNT8                __at(0xF70);	// @ (0x1EE * 8 + 0)
#define                                 CNT8_bit            _BIT_ACCESS(I2C1CNTH,0)
// I2C1CNTH<CNT9>
extern volatile __bit                   CNT9                __at(0xF71);	// @ (0x1EE * 8 + 1)
#define                                 CNT9_bit            _BIT_ACCESS(I2C1CNTH,1)
// I2C1PIE<CNTIE>
extern volatile __bit                   CNTIE               __at(0xF5F);	// @ (0x1EB * 8 + 7)
#define                                 CNTIE_bit           _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNTIF>
extern volatile __bit                   CNTIF               __at(0xF57);	// @ (0x1EA * 8 + 7)
#define                                 CNTIF_bit           _BIT_ACCESS(I2C1PIR,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x117E);	// @ (0x22F * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x3DC);	// @ (0x7B * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x3DD);	// @ (0x7B * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x3DE);	// @ (0x7B * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// CRCCON0<CRCBUSY>
extern volatile __bit                   CRCBUSY             __at(0x345);	// @ (0x68 * 8 + 5)
#define                                 CRCBUSY_bit         _BIT_ACCESS(CRCCON0,5)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x347);	// @ (0x68 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x346);	// @ (0x68 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE2<CRCIE>
extern volatile __bit                   CRCIE               __at(0x23AD);	// @ (0x475 * 8 + 5)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE2,5)
// PIR2<CRCIF>
extern volatile __bit                   CRCIF               __at(0x235D);	// @ (0x46B * 8 + 5)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR2,5)
// IPR2<CRCIP>
extern volatile __bit                   CRCIP               __at(0x23FD);	// @ (0x47F * 8 + 5)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR2,5)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x1805);	// @ (0x300 * 8 + 5)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,5)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0x118C);	// @ (0x231 * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0x118D);	// @ (0x231 * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0x118E);	// @ (0x231 * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCLK<CS4>
extern volatile __bit                   CS4                 __at(0x11B4);	// @ (0x236 * 8 + 4)
#define                                 CS4_bit             _BIT_ACCESS(ADCLK,4)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0x11B5);	// @ (0x236 * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// I2C1CON1<CSD>
extern volatile __bit                   CSD                 __at(0xF38);	// @ (0x1E7 * 8 + 0)
#define                                 CSD_bit             _BIT_ACCESS(I2C1CON1,0)
// I2C1CON0<CSTR>
extern volatile __bit                   CSTR                __at(0xF34);	// @ (0x1E6 * 8 + 4)
#define                                 CSTR_bit            _BIT_ACCESS(I2C1CON0,4)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x3E7);	// @ (0x7C * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE3<CSWIE>
extern volatile __bit                   CSWIE               __at(0x23B0);	// @ (0x476 * 8 + 0)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE3,0)
// PIR3<CSWIF>
extern volatile __bit                   CSWIF               __at(0x2360);	// @ (0x46C * 8 + 0)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR3,0)
// IPR3<CSWIP>
extern volatile __bit                   CSWIP               __at(0x2400);	// @ (0x480 * 8 + 0)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR3,0)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0xCC8);	// @ (0x199 * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0xCE0);	// @ (0x19C * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0xCE1);	// @ (0x19C * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0xCE2);	// @ (0x19C * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0xCE3);	// @ (0x19C * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0xCE4);	// @ (0x19C * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0xCE5);	// @ (0x19C * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0xCD8);	// @ (0x19B * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0xCD9);	// @ (0x19B * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0xCDA);	// @ (0x19B * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0xCDB);	// @ (0x19B * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0xCDC);	// @ (0x19B * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0xCDD);	// @ (0x19B * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE5<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x23C2);	// @ (0x478 * 8 + 2)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE5,2)
// PIR5<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x2372);	// @ (0x46E * 8 + 2)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR5,2)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0xCF5);	// @ (0x19E * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1PPS<CWG1INPPS0>
extern volatile __bit                   CWG1INPPS0          __at(0x1CC8);	// @ (0x399 * 8 + 0)
#define                                 CWG1INPPS0_bit      _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1INPPS1>
extern volatile __bit                   CWG1INPPS1          __at(0x1CC9);	// @ (0x399 * 8 + 1)
#define                                 CWG1INPPS1_bit      _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1INPPS2>
extern volatile __bit                   CWG1INPPS2          __at(0x1CCA);	// @ (0x399 * 8 + 2)
#define                                 CWG1INPPS2_bit      _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1INPPS3>
extern volatile __bit                   CWG1INPPS3          __at(0x1CCB);	// @ (0x399 * 8 + 3)
#define                                 CWG1INPPS3_bit      _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1INPPS4>
extern volatile __bit                   CWG1INPPS4          __at(0x1CCC);	// @ (0x399 * 8 + 4)
#define                                 CWG1INPPS4_bit      _BIT_ACCESS(CWG1PPS,4)
// IPR5<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x2412);	// @ (0x482 * 8 + 2)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR5,2)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0xCFA);	// @ (0x19F * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0xCFD);	// @ (0x19F * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// CWG1AS0<CWG1LSDB0>
extern volatile __bit                   CWG1LSDB0           __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 CWG1LSDB0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSDB1>
extern volatile __bit                   CWG1LSDB1           __at(0xCFD);	// @ (0x19F * 8 + 5)
#define                                 CWG1LSDB1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD2<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x1816);	// @ (0x302 * 8 + 6)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD2,6)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0xD0C);	// @ (0x1A1 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0xD0D);	// @ (0x1A1 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0xD0E);	// @ (0x1A1 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0xD0F);	// @ (0x1A1 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0xCF0);	// @ (0x19E * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0xCF1);	// @ (0x19E * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0xD08);	// @ (0x1A1 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0xD09);	// @ (0x1A1 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0xD0A);	// @ (0x1A1 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0xD0B);	// @ (0x1A1 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG1PPS<CWGINPPS0>
extern volatile __bit                   CWGINPPS0           __at(0x1CC8);	// @ (0x399 * 8 + 0)
#define                                 CWGINPPS0_bit       _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWGINPPS1>
extern volatile __bit                   CWGINPPS1           __at(0x1CC9);	// @ (0x399 * 8 + 1)
#define                                 CWGINPPS1_bit       _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWGINPPS2>
extern volatile __bit                   CWGINPPS2           __at(0x1CCA);	// @ (0x399 * 8 + 2)
#define                                 CWGINPPS2_bit       _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWGINPPS3>
extern volatile __bit                   CWGINPPS3           __at(0x1CCB);	// @ (0x399 * 8 + 3)
#define                                 CWGINPPS3_bit       _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWGINPPS4>
extern volatile __bit                   CWGINPPS4           __at(0x1CCC);	// @ (0x399 * 8 + 4)
#define                                 CWGINPPS4_bit       _BIT_ACCESS(CWG1PPS,4)
// CLCnSEL0<D1S0>
extern volatile __bit                   D1S0                __at(0xD38);	// @ (0x1A7 * 8 + 0)
#define                                 D1S0_bit            _BIT_ACCESS(CLCnSEL0,0)
// CLCnSEL0<D1S1>
extern volatile __bit                   D1S1                __at(0xD39);	// @ (0x1A7 * 8 + 1)
#define                                 D1S1_bit            _BIT_ACCESS(CLCnSEL0,1)
// CLCnSEL0<D1S2>
extern volatile __bit                   D1S2                __at(0xD3A);	// @ (0x1A7 * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0xD3B);	// @ (0x1A7 * 8 + 3)
#define                                 D1S3_bit            _BIT_ACCESS(CLCnSEL0,3)
// CLCnSEL0<D1S4>
extern volatile __bit                   D1S4                __at(0xD3C);	// @ (0x1A7 * 8 + 4)
#define                                 D1S4_bit            _BIT_ACCESS(CLCnSEL0,4)
// CLCnSEL0<D1S5>
extern volatile __bit                   D1S5                __at(0xD3D);	// @ (0x1A7 * 8 + 5)
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0xD40);	// @ (0x1A8 * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0xD41);	// @ (0x1A8 * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0xD42);	// @ (0x1A8 * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0xD43);	// @ (0x1A8 * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0xD44);	// @ (0x1A8 * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0xD45);	// @ (0x1A8 * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0xD48);	// @ (0x1A9 * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0xD49);	// @ (0x1A9 * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0xD4A);	// @ (0x1A9 * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0xD4B);	// @ (0x1A9 * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0xD4C);	// @ (0x1A9 * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0xD4D);	// @ (0x1A9 * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0xD50);	// @ (0x1AA * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0xD51);	// @ (0x1AA * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0xD52);	// @ (0x1AA * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0xD53);	// @ (0x1AA * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
